[
    {
        "imdb_id": "700391",
        "title": "65",
        "release_date": "2023-03-02",
        "duration": 92,
        "ave_rate": "0.0",
        "poster_path": "/rzRb63TldOKdKydCvWJM8B6EkPM.jpg",
        "backdrop_path": "/eEF40Xk2twM3WjRNZftfo771gjv.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "65 million years ago, the only 2 survivors of a spaceship from Somaris that crash-landed on Earth, must fend off dinosaurs to reach the escape vessel in time before an imminent asteroid strike threatens to destroy the planet.",
        "revenue": 55000000,
        "budget": 45000000,
        "genres": [
            "Science Fiction",
            "Action",
            "Thriller"
        ],
        "synopsis": "65 million years ago, on the planet Somaris, pilot Mills (Adam Driver) convinces his wife Alya (Nika King) that he should take on a two-year space expedition to earn the money needed to treat their daughter Nevine's (Chloe Coleman) illness. Mills will earn thrice his normal salary for this expedition. During the journey, his spaceship, the Zoic, is hit by a mass of asteroids and crash-lands on an alien planet, which unbeknownst to him, is actually Earth. All the passengers were in a Cryogenic induced sleep and Mills was the only being awake as the pilot of the ship.\n\nWith his ship damaged beyond repair, he finds that his passengers have been killed and contemplates suicide until he finds a lone survivor, a young girl named Koa (Ariana Greenblatt). Mills sends a distress beacon for rescue and decides to take care of Koa. However, they have difficulty communicating due to differing languages and a broken translator. Mills surveys the area surrounding the ship and finds skeletons of dinosaurs and steam jet geysers.\n\nMills later discovers a functioning escape shuttle from the Zoic has landed on top of a mountain, 15 kilometers away. To encourage Koa to follow him, Mills lies about her family being atop the mountain, when in reality they perished in the crash. The pair quickly realize the planet is home to dangerous and aggressive alien creatures, which turn out to be Earth's dinosaurs. As Mills protects Koa, they begin to bond. Mills has a device that tells them what is safe to eat. Mills finds some poison berries that he stops Koa from eating.\n\nKoa watches several video messages sent by Nevine. The two are attacked by an unidentified monster, which Mills manages to wound before hiding in a cave. An insect gets into Koa's mouth and starts to suffocate her, but Mills finds it in time and extracts the insect. They are pushed deeper into the cave by a T-Rex who attacks them from outside the cave. Mills manages to injure the creature with his gun. Mills hands a few bombs to Koa, just in case she finds herself alone.\n\nThey enter a narrow shaft to escape the cave. After a rockfall inside the narrow shaft separates them, Mills is trapped inside the cave, while Koa falls outside the cave system into the open jungle. Koa finds a large dinosaur tooth lying in the jungle, which is also very sharp. She laces the tooth with a paste from the poison berries. Mills is attacked by an Oviraptor and Koa is attacked by a raptor-like creature which she traps in a fallen tree log; she uses bombs Mills had given her to kill the dinosaur.\n\nMills kills the Oviraptor with his gun and escapes the cave, however he falls into quicksand while searching for Koa. Koa rescues him and they continue up the mountain. However, Mills discovers that a huge asteroid, the same one whose debris his ship crashed into, will strike Earth in less than 12 hours.\n\nThe two reach the escape shuttle, but Koa is angry when she discovers that Mills lied to her. Mills opens up to Koa about losing Nevine, who had died of her illness while he was away, and promises to protect her. Upon learning rescue is on the way, the two board the escape shuttle, but the asteroid's debris causes it to fall down the mountain. The shuttle cannot launch as it is in the wrong position and facing upside down.\n\nMills and Koa manage to fend off a pair of Tyrannosaurus Rex. Mills goes outside the shuttle as he finds a gun lying on the ground, but the gun wont charge and he has to hide inside the shell of his ship. Koa lures the T-Rexes away from Mills using a projection of Nevine from one of her videos. Mills uses the distraction to shoot down one of the T-Rex, but the other understands the ruse and attacks Koa. Mills charges his gun and shoots the T-Rex dead and saves Koa.\n\nBut the same creature they injured earlier at the cave, which turns out to be an enormous quadrupedal Theropod, also attacks. Mills asks Koa to launch the ship, and runs away. Mills manages to lure it toward a large geyser while Koa stabs it in the eye with a large dinosaur tooth that she coated in poison berries earlier. The pair escapes just in time as the asteroid strikes Earth, causing a cataclysmic event and the extinction of the dinosaurs. With the pod set to meet up with a rescue vessel, the two relax and fly off into the stars.\n\nIn closing titles, the evolution of Earth is shown, at the spot where Mills and Koa left, through an ice age until the present day.",
        "director": "Scott Beck"
    },
    {
        "imdb_id": "288287",
        "title": "A Choo",
        "release_date": "2020-07-15",
        "duration": 101,
        "ave_rate": "0.0",
        "poster_path": "/ekhUMW90LKjIXN3zbNEQhbswJIV.jpg",
        "backdrop_path": "/qk6khjQUF2B655bfX7NEHyhnHS.jpg",
        "origin_country": [
            "TW"
        ],
        "summary": "Even when they were orphans, Wang Yizhi has always been in love with Xinxin. Now older, Yizhi decides to train as a boxer before he allows himself to profess his love, but only for her to fall for a geeky computer engineer who is secretly a popular superhero. When Xinxin gets kidnapped, Yizhi must prove his love and his fighting skills to get the girl of his dreams.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Comedy",
            "Romance",
            "Science Fiction"
        ],
        "synopsis": "",
        "director": "Peter Tsi"
    },
    {
        "imdb_id": "646150",
        "title": "Acceleration",
        "release_date": "2019-11-08",
        "duration": 85,
        "ave_rate": "0.0",
        "poster_path": "/e4dXjhIzuBDeoEybnL6i5eQKzHb.jpg",
        "backdrop_path": "/tlIWzVyhD8ctqTr9ivwc8Sfs79S.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "After being double crossed by his most trusted operative, a ruthless crime lord takes revenge by kidnapping the her son. Overwhelmed with fear, the operative is given one night to make up for her misdeeds by systematically eliminating his enemies. As the hours rush by, the steaks begin to rise and the darkened city streets turn into a brutal and bloody battle ground.",
        "revenue": 0,
        "budget": 3000000,
        "genres": [
            "Action",
            "Thriller"
        ],
        "synopsis": "",
        "director": "Michael Merino"
    },
    {
        "imdb_id": "75674",
        "title": "Act of Valor",
        "release_date": "2012-02-24",
        "duration": 110,
        "ave_rate": "0.0",
        "poster_path": "/1Xcd5ci69pVXMPP02DU11Ffq0yY.jpg",
        "backdrop_path": "/bHefJgSTO3JOZy9fETN6cWpvbMX.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "When a covert mission to rescue a kidnapped CIA operative uncovers a chilling plot, an elite, highly trained U.S. SEAL team speeds to hotspots around the globe, racing against the clock to stop a deadly terrorist attack.",
        "revenue": 82499399,
        "budget": 12000000,
        "genres": [
            "Action",
            "Thriller",
            "War"
        ],
        "synopsis": "In the Philippines, a terrorist kills the U.S. ambassador, his son, and dozens of children, using a vehicle-borne IED at an elementary school. The mastermind, a Chechen terrorist named Abu Shabal (Jason Cottle), escapes to a training camp in Indonesia. In Costa Rica, two CIA operatives, Walter Ross (Nestor Serrano) and Lisa Morales (Roselyn Sánchez) meet to consolidate intelligence about their target, a drug smuggler named Mikhail \"Christo\" Troykovich. Christo's men kill Ross and capture Morales, who is imprisoned in a jungle compound and tortured.\n\nAt Coronado, the members of Bandito Platoon, SEAL Team Seven are at home. Lieutenant Rorke (Lt. Cdr. Rorke Denver) confides to Chief Dave that his wife is pregnant and has the entire team spend time together with their families until their next deployment. SEAL Team Seven is then deployed to Costa Rica to ex-filtrate Morales.\n\nThe seven Navy SEALs insert into the jungle via HALO and hold position outside the compound all night. At dawn, Special Warfare Combatant-craft Crewmen (SWCCs) are inserted down the river from the compound on-board Special Operations Craft - Riverine (SOC-R) and deploy a drone that identifies the guards and a large group of enemies camped down the road. The SEALs approach the compound, hear Morales being tortured, and decide to enter the compound early. Rorke and Weimy, the team sniper, provide cover for the other five, led by Dave, who conduct room-clearing, engaging several enemy guards. SEAL operative Mikey is shot in the eye, blinding him and knocking him unconscious. The SEALs extract Morales, escaping with her and recovering a cell phone full of the information she had gathered. However, the gunfight alerts the enemy quick reaction force down the road, who drive toward the camp. The SEALs commandeer an enemy truck and ex-filtrate. The hot pursuit forces them to revert to a tertiary extraction point where the SOC-R boats extract the team and neutralize the enemy pursuit with mini-guns.\n\nCristo and Shabal, who are revealed to have been childhood friends, meet in Kiev. Cristo knows the CIA is watching him and informs Shabal that subordinates will complete their project. Shabal is enraged, but he goes to the factory that Cristo specified where bomb vests are being assembled. These use plastic explosives and ceramic ball bearings to work like an enormous clay-more mine. They can evade metal detectors and are thin enough to be worn under any clothing without attracting attention.\n\nOn the amphibious assault ship USS Bonhomme Richard, Senior Chief Petty Officer Miller, the operations officer of the SEAL team, informs Rorke that Mikey will survive but has lost his sight in one eye. In addition, the intelligence they recovered confirms that Shabal and Cristo were working together. Shabal, an old-school Muslim terrorist, seeks to bring jihad to the U.S., while Cristo is not merely a drug dealer, but a smuggler, with routes and contacts for smuggling people into the U.S. Two of the SEALs, Ajay and Ray, are sent to Somalia, where an arms transfer involving Shabal is taking place. The remaining SEALs, comprising Rorke, Dave, Sonny and Weimy, stay in the U.S. in case the terrorists make it in. Miller himself has been reassigned to SEAL Team Four, hunting for Cristo somewhere on the oceans. Lieutenant Rorke gives a letter to Dave in case he is killed.\n\nThe two SEALs in Somalia confirm the presence of Shabal and sixteen terrorists and identify his plane. They track the plane to an island off Baja California, where the team stages an assault. They successfully attack and secure the island, killing eight terrorists. Rorke is nearly killed by an RPG that strikes his vest directly in the chest but does not detonate.\n\nMeanwhile, in the South Pacific, Cristo is hiding aboard his yacht, guarded by gunboats and mercenaries. SEAL Team Four identifies the yacht with satellite imaging and deploys several helicopters and gunboats. They quickly kill the guards and capture Cristo. Senior Chief Miller conducts his interrogation. Threatened with permanent separation from his family along with other implied sanctions, Cristo reveals his connection with Shabal and his plans to have his martyrs detonate their vests at strategic points throughout the U.S., causing a panic and doing economic damage surpassing that following the September 11 attacks. But Christo says he is powerless to stop the attack.\n\nThe SEALs are informed that not all of their targets were neutralized and that half, including Shabal, are en route to the U.S. via tunnels underneath a milk factory. They are ordered to link up with Mexican Special Forces and neutralize the remaining targets. U.S. Marines relieve the SEALs, who then travel on to Mexico meeting the Mexican Special Forces. The Mexican leader informs the SEALs that the assault will be extremely dangerous, as the smugglers are supported by the well-armed local drug cartel, and that a \"Black Hawk Down\"-style stalemate would have political consequences.\n\nThe SEALs and Mexican forces assault the factory, hiding in dump trucks. The combined forces cordon off the factory while Rorke, the Mexican officer, Chief Dave, Sonny, and several other SEALs led by Weimy clear most of the factory. The Mexican officer is wounded and the SEALs are nearly killed as the explosive vest of a suicide bomber detonates. As they reach the tunnels, an enemy fighter drops an F1 fragmentation grenade into the room. Only Lieutenant Rorke sees the grenade land. Realizing his team cannot escape the room in time, he dives on the grenade and it detonates, mortally wounding him.\n\nDave pursues the terrorists alone, while Sonny tends to Rorke. Dave catches up to the terrorists as they try to escape through the tunnels, but shoots seven of them as they flee into the entrance. Shabal appears, however, and fires nearly thirty rounds from an AK-47 into Dave, destroying his weapon in addition to wounding him critically. Dave draws his sidearm and kills the eighth suicide bomber as he runs into the tunnel. Shabal approaches Dave and prepares to execute him but is intercepted by Sonny.\n\nAt home, Rorke is given a military funeral with full honors. The SEALs pay their respects, punching the gold SEAL tridents that signify them as SEALs into Rorke's coffin. It is then revealed that Dave's narration throughout the movie was a written letter meant for Rorke's son, explaining the valor of the father he will never know, and ending with the poem \"Live Your Life\" by Tecumseh. The film ends with a dedication to every U.S. Navy SEAL killed in action since 9/11 along with a listing of their names.",
        "director": "Mike McCoy"
    },
    {
        "imdb_id": "12683",
        "title": "Alone in the Dark 2",
        "release_date": "2008-09-01",
        "duration": 88,
        "ave_rate": "0.0",
        "poster_path": "/dGKQoqyYnleFrz3DIBANG00QccO.jpg",
        "backdrop_path": "/v3mBCWQpbTCL8S6dHTJinUfo0or.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "When the night falls, and the creatures of the dark are crawling out of the shadows, there is only one man who stands between us and evil: Edward Carnby.",
        "revenue": 0,
        "budget": 4600000,
        "genres": [
            "Action",
            "Fantasy",
            "Horror"
        ],
        "synopsis": "\"Alone in the Dark 2\" tells the story of Edward Carnby, who joins forces with a team of witch hunters to track down the dangerous witch Elisabeth Dexter.",
        "director": "Peter Scheerer"
    },
    {
        "imdb_id": "35284",
        "title": "Anzio",
        "release_date": "1968-07-24",
        "duration": 117,
        "ave_rate": "0.0",
        "poster_path": "/m958bPae1S54GbF9pqpRwmqhCPZ.jpg",
        "backdrop_path": "/4zKicMniOnma5jcckeYkMZ2AwsU.jpg",
        "origin_country": [
            "IT"
        ],
        "summary": "American troops land unopposed on Italian beaches during World War II, but instead of pushing on to Rome, they dig in and the Germans fight back ferociously.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Drama",
            "War",
            "History"
        ],
        "synopsis": "",
        "director": "Duilio Coletti"
    },
    {
        "imdb_id": "14028",
        "title": "Behind Enemy Lines III: Colombia",
        "release_date": "2009-01-06",
        "duration": 94,
        "ave_rate": "0.0",
        "poster_path": "/K5R3hdUJ5x3McuGQHlxi6ApasV.jpg",
        "backdrop_path": "/u6wV4GNjhuk5guid0DqJ5CnI0KM.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "Navy SEALS mount an attack on Colombian special forces to clear their names and rescue a hostage.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "War",
            "Action",
            "Thriller"
        ],
        "synopsis": "",
        "director": "Tim Matheson"
    },
    {
        "imdb_id": "402200",
        "title": "Ben 10/Generator Rex: Heroes United",
        "release_date": "2011-11-25",
        "duration": 46,
        "ave_rate": "0.0",
        "poster_path": "/iSPCeuGiN06540ZUCfcunc4hOm3.jpg",
        "backdrop_path": "/ltm4l5TsbsfrPp6GUMYhq2nvm1N.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "Ben Tennyson falls through a wormhole and encounters Rex. The two heroes must unite against a foe that can absorb their powers.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Animation"
        ],
        "synopsis": "A mysterious rift begins to open in the skies of Manhattan. Meanwhile, former agent of peacekeeping organization, \"Providence\", Rex Salazar is sparring against fellow agent, Agent Six, while musing about his need for a theme song, before getting the alert about the rift. Providence appears on the scene to stop the rift, but are unable to do anything before Rex arrives with Six and Bobo. Doctor Holiday, scientist and love interest of Agent Six, then gets a scan that shows something is coming through the rift, and Rex finds himself (unknowingly) fighting against Ben Tennyson, in the form of Humungousaur. During their skirmish, a strange metallic creature also appears and heads into the city, with Bobo and Six on its trail. Ben switches to Rath as Rex continues to try curing him; an annoyed Ben demands Rex stop as he doesn't even know what an EVO is. Changing back to human form, Ben is shocked that no one has heard of him despite being a celebrity. Then, Six appears with the creature, which self-destructs and renders him comatose, leaving Rex mortified and angered at Ben.\n\nAt Rex's hideout, Ben is locked up in a containment unit, while Doctor Holiday explains that the creature was nanite in origin, but somehow completely different from an EVO. Ben offers help but is denied, and escapes into the night as Big Chill. Rex chases after Ben and both confronted by Caesar, who explains the creature's origin, saying that he created the creature (named \"Alpha\") as a means of manufacturing nanites that could adapt for any scientific need, but it became rogue as it developed sentience and tried to possess human bodies due to its inability to hold a physical form within a machine, forcing Caesar to banish it to another dimension. However, Ben reveals that Caesar actually sent Alpha into the Null Void, a prison dimension for intergalactic criminals that the Plumbers capture, allowing Alpha to obtain a physical form within an alien and find its way back to Manhattan. Alpha invades to absorb EVOs for their nanites, hoping to gain control of Rex's as it knows he holds the key to it obtaining perfection.\n\nBack at base Ben and Rex explain each other's origins, as White Knight reveals that Alpha has gone to the Bug Jar, which is full of EVOs for it to absorb. Rex, White Knight, and Ben arrive, only to find themselves against the nearly invincible Alpha, which begins to attack to take control of Rex's Omega Nanite. Ben fights as XLR8 and Four Arms. During the battle, Ben gains the form of Shocksquatch, but then temporarily loses his powers when Alpha copies the Ultimatrix and takes on Nanite powered versions of Heatblast, Fourarms, and Humungousaur. After a tough battle, Rex is able to disable Alpha's imitation Omnitrix powers, but is ensnared and robbed of his Omega Nanite, leading to Nanite Alpha to transform into a colossal being calling itself Alpha-Omega; the beginning and the end. As the now nearly unstoppable Alpha-Omega rampages, Rex has doubts about himself now that most of his builds are gone. Ben however comes up with a plan, and transforms into Upgrade and merges with Rex. The duo then take on the Alpha-Omega, weakening it enough for Rex to finally condense Alpha into a sphere of matter that weighs several tons. As Alpha was being condensed, Caesar appears and extracts the Omega Nanite. Attempting to dispose of Alpha, Caesar then opens a rift for Ben, who changes into Upchuck and devours the compacted Alpha as he heads back to his world. Rex returns to base, one last time, to find himself with a revived Agent Six. Caesar injects the Omega Nanite into Rex, as Alpha, now in the Null Void, begins to stir within its prison of matter, meaning it is not over yet.",
        "director": "Chris Graham"
    },
    {
        "imdb_id": "177572",
        "title": "Big Hero 6",
        "release_date": "2014-10-24",
        "duration": 102,
        "ave_rate": "0.0",
        "poster_path": "/2mxS4wUimwlLmI1xp6QW6NSU361.jpg",
        "backdrop_path": "/t3DdoWhv8xvk6K1PabKjMJGTwwt.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "A special bond develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.",
        "revenue": 657827828,
        "budget": 165000000,
        "genres": [
            "Adventure",
            "Family",
            "Animation",
            "Action",
            "Comedy"
        ],
        "synopsis": "In the city of San Fransokyo (a portmanteau of San Francisco and Tokyo), Hiro Hamada (Ryan Potter) is a teenage prodigy, but seems to be unable to use his intellect for anything more than trying to enter illegal, back-alley bot-fights.\n\nHis older brother Tadashi (Daniel Henney) wishes to change Hiro's mind, and tricks his brother into coming to the San Fransokyo Institute of Technology, where Tadashi is a student. While there, Hiro is introduced to a number of Tadashi's 'nerd school' friends: Go Go (Jamie Chung), Wasabi (Damon Wayans Jr.), Honey Lemon (Genesis Rodriguez), and Fred (T.J. Miller), and the different inventions they have constructed.\n\nTadashi then shows Hiro his own project: an inflatable 'nurse' robot, named Baymax (Scott Adsit). Thanks to a chip that Tadashi programmed with numerous medical analysis information, Baymax is quite knowledgeable, impressing Hiro. Once he has performed his task, Baymax returns to sleep mode by being told, \"I am satisfied with my care.\"\n\nThe three also meet Robert Callaghan (James Cromwell), the head professor of the Institute, and after he compliments Hiro on the miniature battle-robot he's made, Hiro wants to enter the Institute.\n\nTadashi then encourages his brother to come up with something that will impress Callaghan at the next robotics exhibit coming up. After Tadashi encourages his brother to 'use that big brain of yours,' Hiro then uses the robotic technology in his battle-bot, and crafts them into thousands of micro-bots, controlled by a neural transmitter. Whatever the wearer thinks, the microbots will do.\n\nNeedless to say, Hiro's presentation wins over a number of people at the exhibition, even impressing a high-profile technology guru, named Alistair Krei (Alan Tudyk). Alistair offers to purchase Hiro's microbot invention on the spot, but Callaghan claims that Krei is not a trustworthy man with technology. Hiro then declines Krei's request, but is excited when Callaghan presents him with a letter of acceptance to the Institute.\n\nHiro, Tadashi, and their friends head off to celebrate, but the mood is cut short when a fire erupts within the exhibition hall. With word that Callaghan is still inside, Tadashi rushes into the building to save him. However, as Hiro watches, an explosion rocks the building, blasting him back.\n\nAfter Tadashi's funeral, Hiro becomes distant from his friends, still working through his grief. His aunt (and guardian) Cass (Maya Rudolph), tries to encourage Hiro to go to the Institute and take advantage of his acceptance letter, but he seems unwilling to do so.\n\nAfter accidentally hurting himself in his room, Hiro is surprised when Baymax appears. Apparently, Tadashi had brought him back to their shared bedroom before he died. Baymax attempts to help Hiro, who is reluctant to accept it. However, the mood is broken when Hiro finds one of his microbots wriggling in a pocket of his jacket. Putting it in a specimen container, Hiro tries to ignore it, but Baymax notes inquires if he can try to determine where the 'small robot' wishes to go.\n\nHiro casually affirms this...not realizing that the robot will follow his commands. Chasing him down, Hiro and Baymax find themselves at an old warehouse. Sneaking inside, Hiro is surprised to find a machine churning out similar microbots, with numerous containers filled with them. However, his surprise turns to shock, when a masked man appears, attempting to kill Hiro and Baymax with the miniature robots.\n\nHiro first goes to the police station to report what he's found, but the officer taking down his story seems reluctant to believe him. It also doesn't help that Baymax's battery starts to run low. Hiro manages to get him home to be recharged. It is then that Baymax inquires where Tadashi is. Hiro attempts to explain to the robot that his brother is 'gone.' When Hiro explains that the fire was an accident, he then begins to wonder, given what he saw today...what if it wasn't, an accident?\n\nDeciding to figure out who has stolen his invention, Hiro decides to upgrade Baymax. After creating a carbon-fiber suit for the robot, Hiro also programs a new chip that includes numerous martial arts moves, inserting it into an additional slot in Baymax's 'heart' drive, right next to Tasashi's chip of Baymax's programming.\n\nThe two then return to the warehouse, only to find it empty. However, Hiro notes his microbot has started to move again, and the two follow its movements to the docks off San Fransokyo. However, something pulls the microbot out of the container, and it disappears off into the misty bay. However, moments later, the masked figure appears, using the microbots as a transport means, and carrying a large object with the symbol of a red bird on it.\n\nHiro is just about to send Baymax to get the masked man, when they are accosted by Hiro's friends. Baymax's invite for them to help cheer up Hiro got through, but just then, the masked man attacks them. The group pile into Wasabi's car, as the masked man gives chase. In the aftermath, the car ends up driving into the bay, but the group is saved by Baymax, who has shed his armor, and helps the group float to the surface.\n\nAfter getting on land, Fred leads the group to his home...which happens to be a large mansion owned by his parents (who are away).\n\nWhile recovering, Hiro shows the group the red bird symbol he saw on the piece of machinery to his friends, but none have seen it. The group soon comes to a consensus, that the man may have been behind Tadashi's death, and Fred believes he knows who it is: Alistair Krei. Fred explains that it was Krei who wanted Hiro's microbot technology, and most likely, has gained it at the expense of Tadashi's life.\n\nBaymax also surprises Hiro, when he explains that during the fight, he scanned the masked man, and has information on his health and vitals. Hiro wants to identify where their adversary is, but he would need to scan everyone in San Fransokyo to find out.\n\nThe group then decides to band together to stop Krei, with Hiro helping to design them each special suits based on their specific abilities.\n\nOnce Hiro has done this, he and Baymax fly up above the city, and scan the city from an aerial fan. Baymax's sensors pick up their adversary's health vitals, coming from an island in the bay.\n\nThe group flies there, to find a deserted base. One room shows the twisted metal remains of some machine, with the red bird symbol on it. The group then goes into a control room, where video shows that the room was used for testing a teleportation project, called \"Operation: Silent Sparrow.\"\n\nSuddenly, their masked adversary appears, and the group attempts to take him down, but are completely unsure what to do. Hiro manages to unmask their foe, but instead of finding Krei...he finds Professor Callaghan.\n\nCallaghan explains that in the fire, he managed to use Hiro's microbot technology to shield himself from the explosion. This infuriates Hiro, who demands that Baymax destroy Callaghan. Baymax claims that his programming doesn't allow this, leading to Hiro pulling out the chip Tadashi put in him. The removal of the chip causes Baymax to follow Hiro's orders, and he charges at Callaghan. However, Hiro's friends attempt to stop Baymax, with the robot fighting back at them, before Honey manages to restore Tadashi's chip to his programming.\n\nCallaghan has escaped during the fight, and Hiro demands that Baymax find him, only for the robot to explain that his scanners are damaged. Bent on revenge, Hiro blasts away with Baymax back to the garage. He attempts to update Baymax's programming, but Baymax refuses to open the port where his chip information is.\n\nIn desperation, Hiro finally breaks down over the death of his brother, with Baymax countering that, 'Tadashi is here.' As Hiro watches, Baymax projects video of Tadashi's numerous attempts to get him running, with the 84th test being a success, and Tadashi claiming that Baymax is \"going to help a whole lot of people.\"\n\nHiro's friends eventually return to the garage where he is, and reveal that they have found further footage of the military test. The footage shows Professor Callaghan also at the test area, and reveal his motives behind his actions. During the test, a human test subject was propelled into the portal. However, the portal became unstable, and Krei ordered it shut down. It turns out that the test subject, was Callaghan's daughter, Abigail (Katie Lowes).\n\nThe next day, Krei is revealing the opening of a new facility in the heart of San Fransokyo, when Callaghan appears, using the microbots to piece together the last active portal, over Krei's building. Callaghan claims he's going to ruin Krei's life like he ruined his, as the portal comes to life, and starts to tear apart the building, sucking its pieces into the other dimension.\n\nIt is then that Hiro and his friends appear, pleading with Callaghan to stop what he's doing, but the former Professor refuses to listen to reason. The group attempts to stop him, but Callaghan uses the microbots to counter their attacks.\n\nDuring the fight, Hiro notices that the stray microbots are being sucked up into the portal, and he and the rest of the team work to hack away at their structures, until Callaghan is soon down to a bare minimum.\n\nBaymax manages to remove the control mask from him, but once he's done so, notes a faint life signal from within the portal. Even though it is unstable, Hiro and Baymax head into it.\n\nWithin the otherworldly atmosphere, they find the test pod, with Abigail inside. Baymax and Hiro then attempt to maneuver her out of the dimension, but a stray piece of debris from Krei's building slams into Baymax, ripping away much of his suit, and rendering his rocket boosters inoperable.\n\nBaymax claims that he can get Hiro and Abigail to safety by using his rocket punch. Hiro doesn't want to lose Baymax, but the robot assures the boy, that he'll \"always be with him.\" Tearfully, Hiro utters \"I'm satisfied with my care,\" and Baymax launches off his rocket fist, getting Hiro and Callaghan's daughter through the portal, just before it tears itself apart.\n\nIn the aftermath, Abigail is taken to a hospital, and Callaghan is arrested for his crimes. In the meantime, local news reports on a band of superheroes that saved the city. However, Hiro and his friends celebrate by having some downtime at his Aunt's place.\n\nShortly afterwards, Hiro starts his classes at the San Fransokyo Institute of Technology. Taking residence in the same lab that Tadashi has, Hiro has brought along the rocket fist Baymax wore...only to find wedged in its closed fist, the green microchip card that Tadashi had put into Baymax.\n\nHiro manages to rebuild Baymax, and places the chip inside him, embracing his fellow comrade. In the end, we see Hiro, Baymax, and their friends, running through the streets of San Fransokyo, ready to help their city, in any way they can.",
        "director": "Chris Williams"
    },
    {
        "imdb_id": "62177",
        "title": "Brave",
        "release_date": "2012-06-21",
        "duration": 93,
        "ave_rate": "0.0",
        "poster_path": "/1XAuDtMWpL0sYSFK0R6EZate2Ux.jpg",
        "backdrop_path": "/esIwzihCKlyqT6AjdI3q6WdSi5u.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "Brave is set in the mystical Scottish Highlands, where Mérida is the princess of a kingdom ruled by King Fergus and Queen Elinor. An unruly daughter and an accomplished archer, Mérida one day defies a sacred custom of the land and inadvertently brings turmoil to the kingdom. In an attempt to set things right, Mérida seeks out an eccentric old Wise Woman and is granted an ill-fated wish. Also figuring into Mérida’s quest — and serving as comic relief — are the kingdom’s three lords: the enormous Lord MacGuffin, the surly Lord Macintosh, and the disagreeable Lord Dingwall.",
        "revenue": 539000000,
        "budget": 185000000,
        "genres": [
            "Animation",
            "Adventure",
            "Comedy",
            "Family",
            "Action",
            "Fantasy"
        ],
        "synopsis": "In a prologue, we see Lord Fergus and Lady Elinor in a forested area, celebrating the birthday of their young daughter, Merida. Though Elinor happily plays with Merida, she grows perturbed when Fergus gives the little girl her own bow and set of arrows.\n\nAs Merida tries to hit a target, one of the arrows sails off into the forest nearby. Merida runs off and retrieves it, but soon encounters a glowing blue willo-the-wisp. Going back to her parents, she tells what she saw, and her mother explains that they can lead a person to their destiny.\n\nSuddenly, the mood is broken as an enormous black bear enters the camp grounds. Merida and her mother quickly take leave as Lord Fergus and his men fight against the bear.\n\nTime passes, and we see that Lord Fergus has lost his leg to the bear. In the time that has passed, Lady Elinor has given birth to three mischievous boys (triplets), and Merida is now a teenager. While her mother wants her to be proper, Merida is moreso intent on practicing archery, and journeying off in the forest.\n\nOne evening, a messenger brings word that the 3 neighboring clans have accepted the offer to fight for Merida's hand in marriage. Naturally, the young woman is not at all happy with this situation. Elinor explains to her daughter that the clans must be kept in harmony, or chaos may reign. She relates the story of how the clans were descended from four brothers, but one of them wanted more power than the others, and caused the balance of power to crumble. Even so, this does little to quell Merida's resentment of the betrothal.\n\nThe three clans soon arrive, and Lords MacGuffin, Macintosh, and Dingwall arrive with each of their sons. Per tradition, each of the first-born of the clans will fight in the event that the Princess chooses. This causes Merida to perk up, and she eagerly suggests archery.\n\nWhen it comes to the sport, almost none of the sons are good at the sport, but everyone is shocked when Merida appears before everyone, claiming that since she's a first-born as well, she'll be 'fighting for her own hand.' Elinor demands Merida stop, but she defies her mother, and makes a bulls-eye on each of the targets.\n\nNaturally, Elinor feels angry and humiliated at this, and both mother and daughter have a heated conversation in her room later on. Merida claims she does not want to be like her mother, and in anger, slashes a tapestry depicting the family, slicing a hole between her and her mother in the piece.\n\nUpset by this as well, Elinor loses her temper, and throws Merida's bow in a fireplace nearby. Upset by this, Merida flees the castle. Unseen by Merida, her mother regrets what she has done a few moments later, and manages to retrieve the bow from the fire.\n\nMerida flees to the forest, where she comes across a circle of stones, and several willo-the-wisps. Following them, she finds a small cottage inhabited by an old woman. The old woman claims she is just a wood carver, but Merida soon realizes she's actually a witch, when she notices an enchanted broom, and the woman's crow (which can talk!).\n\nMerida eagerly asks for a spell to change her mother, but the witch refuses, claiming she did a spell once before, and regretted it. However, Merida gets her to reconsider when she agrees to purchase all her wood carvings. The offer is too much to resist, and the witch brews a concoction that produces a small pie. Merida is instructed to give it to her mother, and she eagerly ruses off to do so.\n\nReturning to the castle, King Fergus is doing his best to quell the Lords after the events of the tournament. Merida encounters her mother in the kitchen, and eagerly gives her the pie, but after one bite, Elinor claims she does not feel well.\n\nMerida happily leads her to her chambers, but soon her happiness that her mother will change turns to shock...when her mother turns into a black bear!\n\nKnowing that King Fergus will surely kill Elinor, Merida enlists the aid of her brothers to distract Fergus and the Lords, while she sneaks her mother out of the castle, and back into the forest.\n\nThe two manage to find the witch's hovel, but find it is now empty. A message left for Merida tells that the Witch has gone away until the next Spring, and that the spell will become permanent within 2 sunrises. However, if Merida wants to reverse the effects, she has heed some specific words, in regards to 'mending.' Merida is unsure just what this means, and the two sleep in the woods that evening, before having breakfast in the morning.\n\nMerida manages to catch some fish for her mother, but when her mother demands more, Merida tells her mother she will need to catch them herself. The mother and daughter bond over this method, but when her mother wanders off into the woods, Merida chases after her. However, upon finding her, her mother suddenly attempts to attack Merida, before returning to normal. With less than 24 hours, it seems that if they do not find a way to reverse the spell, Elinor will lose her humanity, and become a bear forever!\n\nAs they wander in the woods, the two come across the willo-the-wisps again, and follow them. They are lead to a high mountain, and the ruins of a great castle. Inside, Merida finds a stone tablet depicting 4 men, with one of them separated from the group. Soon, Merida realizes that she is in the castle in the legend her mother told her about, and soon makes the connection:\n\nThe brother who attempted to seize power from his siblings went to the witch, and her spell turned him into a bear...powerful and stronger than his brothers, but he was unable to change back, and became a rampaging beast, the same one who took Lord Fergus' leg!\n\nSuddenly, the bear emerges from the darkness and attempts to attack Merida. Elinor manages to save her daughter, and the two head back to the circle of stones. However, Merida is now sure what needs to be done. The witch's spell mentioned mending, and Merida feels that if she can mend the tapestry she cut the day before, her mother will be saved.",
        "director": "Mark Andrews"
    },
    {
        "imdb_id": "25769",
        "title": "Carriers",
        "release_date": "2009-09-04",
        "duration": 84,
        "ave_rate": "0.0",
        "poster_path": "/jxjnjHtHXgvjdhkwpelE9ZwVMg6.jpg",
        "backdrop_path": "/uYxAGovHS4mCGsIeSZCTtwOQ5Po.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "A deadly virus has spread across the globe. Contagion is everywhere, no one is safe, and no one can be trusted. Four friends race through the back roads of the American West on their way to a secluded utopian beach in the Gulf of Mexico where they could peacefully wait out the pandemic. Their plans take a grim turn when their car breaks down on an isolated road starting a chain of events that will seal their fates.",
        "revenue": 5805279,
        "budget": 0,
        "genres": [
            "Action",
            "Drama",
            "Horror",
            "Science Fiction",
            "Thriller"
        ],
        "synopsis": "",
        "director": "Àlex Pastor"
    },
    {
        "imdb_id": "28735",
        "title": "Deathsport",
        "release_date": "1978-04-01",
        "duration": 82,
        "ave_rate": "0.0",
        "poster_path": "/93SoKkzv4D8TCequN1IBAN1u1xy.jpg",
        "backdrop_path": "/uYx0Hu1SOiOUKMkQlj9tdAa5mnU.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "1000 years into the future, after the Great Neutron Wars, the world is divided into desert wastelands and isolated city-states. Notorious \"Desert Ranger\" Kaz is forced to fight in the DeathSport, dueling on futuristic motorcycle \"Death Machines\". With the help of renegade vixen Deneer, Kaz must face his past and fight to save himself and his people.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Thriller",
            "Science Fiction"
        ],
        "synopsis": "",
        "director": "Allan Arkush"
    },
    {
        "imdb_id": "180688",
        "title": "Deep Dark Canyon",
        "release_date": "2013-04-23",
        "duration": 90,
        "ave_rate": "0.0",
        "poster_path": "/lY1sx46thaFbZElgt9ZnmCWr3mY.jpg",
        "backdrop_path": "/moLEAymmPspsJY0KbnG12pZscmY.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "Bloom Towne is a small-town sheriff under the thumb of the well-established, deeply influential Mayor Dick Cavanaugh's family. When Bloom's two teenage sons, Nate and Skylar accidentally shoot and kill Dick during a deer-hunt, Bloom's long-held allegiance to the reigning Cavanaugh clan is tested. Skylar (still a minor) decides to take the wrap for his older brother Nate, claiming he fired the fatal shot. The Cavanaugh family's quick retaliation sends Skylar on his way to county jail, soon to be tried as an adult. Desperate and guilt-ridden, Nate breaks Skylar out of jail and sets off a chain of lawless acts, which send them deep into the woods and on the run. Bloom's choice between the law and his sons leads to revelations of old family secrets that threaten to destroy everything he loves.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Drama",
            "Thriller"
        ],
        "synopsis": "For his 17th birthday, Skylar gets to go hunting deer with his brother Nate. What they are shooting at is not shown, and they don't seem to be entirely sure what it is.\n\nDick Cavanaugh, mayor of the small town of Guerneville, California, is dead.\n\nThe boys do the right thing. As it turns out, their father Bloom is the police chief, so maybe Skylar won't get in too much trouble. It was, after all, an accident.\n\nLloyd is one of the town's cops and, although he is a Barney Fife type when it comes to enforcing the law, he seems to be on the boys' side.\n\nThe problem is that the Cavanaugh family seems to run the town. Every business seems to have the Cavanaugh name on it. Accident or not, Skylar will be tried as an adult. For one thing, there is motive. Deputies come to take him to Santa Rosa.\n\nBut they won't make it, if Nate has anything to say about it. This puts the boys in deeper trouble.\n\nSurvivalist Uncle Mike gets involved. He is still upset that Sarah is dead. Who is Sarah? This is revealed later but for now things are even worse for the boys.\n\nNate and Skylar are on the run, but for now things aren't too bad. Tony and Joel are morons among those hunting for them (yes, hunting in that sense of the word; these are people who love their guns and believe justice involves bullets rather than a jury).\n\nBut not everyone is so incompetent. Randy is in charge of the search and he is a no-nonsense, capable cop, who comes across like a drill sergeant. Fortunately for the boys, Eric and Ronnie are even bigger morons than Tony and Joel. Finally, Guthrie is the biggest idiot of the bunch, and with the boys' father searching for them and hoping to help them out of their predicament, this turns out to be a positive development.\n\nA couple of other cast members deserve mention. Jamie is the girl Nate likes, and she may be able to help. And Roberta is nearly topless and very frightened.\n\nSo will the boys succeed in their efforts? Nate wants to go to Canada because he believes they will never see freedom if they stay around here. That's if they survive.\n\nMoral dilemmas are a big part of this movie. The fact is that the boys only have a chance at a positive outcome during the first few minutes. After that, the only question is how many laws one is willing to break to rescue them. Morally right at this point becomes a relative concept.",
        "director": "Silver Tree"
    },
    {
        "imdb_id": "42033",
        "title": "Def-Con 4",
        "release_date": "1985-03-15",
        "duration": 88,
        "ave_rate": "0.0",
        "poster_path": "/1JQd3mc1qCtN6wxu2BR9ZkRuUWH.jpg",
        "backdrop_path": "/mV8DiIihfq4MobBIIzaWPqfOcHG.jpg",
        "origin_country": [
            "CA"
        ],
        "summary": "Two men and a woman circle the globe in a satellite armed with a nuclear device. The third world war breaks out, and a few months later the satellite crashes. They survive the crash but one man gets killed by survivors and the other man gets caught. The woman stays by the remains of the the satellite but is soon caught by evil punks who have taken power.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Horror",
            "Science Fiction",
            "Thriller",
            "Action"
        ],
        "synopsis": "",
        "director": "Paul Donovan"
    },
    {
        "imdb_id": "39807",
        "title": "Doc West",
        "release_date": "2009-09-07",
        "duration": 180,
        "ave_rate": "0.0",
        "poster_path": "/pABR4uDBhMm6HsP2fK1jkHlcybc.jpg",
        "backdrop_path": "/jgOqHQS6kj3rlz2E3GJfDdoQTyL.jpg",
        "origin_country": [
            "IT"
        ],
        "summary": "After bandits steal his poker winnings this American legend makes his way to the next town in search of them. Seeking out his revenge during a poker game gone bad Doc West finds himself in the local town jail. When his past is exposed and a battle amongst the town breaks out in gunfire he will have to choose sides, between the outlaws or the law-abiding citizens.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Western",
            "Action"
        ],
        "synopsis": "",
        "director": "Giulio Base"
    },
    {
        "imdb_id": "289143",
        "title": "Dofus - Book I: Julith",
        "release_date": "2016-02-03",
        "duration": 108,
        "ave_rate": "0.0",
        "poster_path": "/pRupT7qQEMWxZQMfeNPd0w05e3W.jpg",
        "backdrop_path": "/1HQVcI3haceSQJl7X8a6KnbrwTg.jpg",
        "origin_country": [
            "FR"
        ],
        "summary": "The strange little guy in the blue hood is well known to Krosmoz. His name is Joris and he's proposing to take you on a fantastic adventure. Our hero is leading a happy life in his magic shop in the city of Bonta. But one day, when he seeks out his idol, a Gobbowl superstar, everything changes for the worst as Julith, the vengeful witch, is back in town!",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Animation",
            "Action",
            "Adventure",
            "Fantasy",
            "Comedy"
        ],
        "synopsis": "",
        "director": "Anthony Roux"
    },
    {
        "imdb_id": "647",
        "title": "Final Fantasy VII: Advent Children",
        "release_date": "2005-07-14",
        "duration": 101,
        "ave_rate": "0.0",
        "poster_path": "/pTIXM2yu8McSlcQVs1VjVSNC45x.jpg",
        "backdrop_path": "/8xhgpYyNSX5sJi0P35hwL73QYOV.jpg",
        "origin_country": [
            "JP"
        ],
        "summary": "Two years have passed since the final battle with Sephiroth. Though Midgar, city of mako, city of prosperity, has been reduced to ruins, its people slowly but steadily walk the road to reconstruction. However, a mysterious illness called Geostigma torments them. With no cure in sight, it brings death to the afflicted, one after another, robbing the people of their fledgling hope.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Animation",
            "Action",
            "Adventure",
            "Fantasy",
            "Science Fiction"
        ],
        "synopsis": "The film begins with a scene in an area surrounded by rock formations. A red, lion-like beast known as Red XIII (Liam O'Brien) can be seen with two younger members of the same species running along the cliff. Eventually, the three reach a cliffside, which they swiftly climb. The camera pans around to show the ruined city of Midgar, overrun with forests and vegetation, as Red XIII roars in the city's direction.\n\nThe scene fades to a shot of a man in a black outfit with silvery hair wheeling another man in a wheelchair out of an elevator. The man in the wheelchair is covered in a white cloth, obscuring his identity. The two walk to the edge of the building, as they discuss a new disease that has struck the city of Edge: Geostigma. It is revealed that the man in the wheelchair is infected with Geostigma, due to the black bruise on his wrist area.\n\nThe scene switches again to a shot of a mountain covered in snow. The Turks Tseng (Ryun Yu) and Elena (Bettina Bush), are heard talking to each other on a radio. A helicopter is then shown, its pilot being another Turk, Reno (Quinton Flynn). The helicopter then descends into what appears to be the Northern Crater, before disappearing in a snowstorm. Multiple gunshots are then heard on the radio, as Tseng and Elena cry out, appearing to have been shot. Elena tells Reno to get out of the crater, and the helicopter can then be seen exiting the crater and flying away.\n\nThe scene fades into a scene in which Marlene Wallace (Grace Rolek) narrates a short summary of the events in Final Fantasy VII, as well as the current state of the city Edge. In summary, the Shinra Electric Power Company used the power of an energy source known as mako to drain the planet of a vital soul known as the Lifestream. Shinra also had a unique section of warriors known as SOLDIER. All SOLDIERs were to be injected with cells from a calamity known as JENOVA, which gave them unique and enhanced abilities. One unique SOLDIER was Sephiroth (George Newbern), regarded for his exceptional ability to fight with a six-feet-long katana. Sephiroth eventually found out about JENOVA, who he believed to be his \"mother\". Eventually, Sephiroth turned insane, burning down the village of Nibelheim and vowing to take revenge on Shinra and even the Planet itself. Sephiroth managed to obtain the Black Materia, which enabled him to summon an incredibly powerful magic known as Meteor, which was to strike the Planet. Another group of warriors, led by Cloud Strife (Steve Burton), attempted to stop Meteor by traveling to the center of the Planet to unlock Holy, the counterpart of Meteor. However, even Holy was not powerful enough, and the Planet was forced to call the Lifestream to stop Meteor. Meteor was destroyed, along with the city of Midgar, home of the Shinra corporation, and Sephiroth was killed by Cloud.\n\nThe city of Edge built beside Midgar is shown, as well as the Midgar memorial, located in the center of the city plaza. Several of the city's children are infected with Geostigma, targeted because of their low immune systems. The inside of the bar \"Seventh Heaven\" is shown, where an orphan named Denzel (Benjamin Bryan) is shown lying on a bed, infected with Geostigma on his forehead. Tifa Lockhart (Rachael Leigh Cook) is shown answering a phone call for the absent Cloud Strife, saying that she \"knows\" the caller.\n\nThe scene shifts again to an empty wasteland, where the Buster Sword is shown stabbed into a cliff, with a wolf behind it. A group of three silver-haired men known as the \"Remnants of Sephiroth\" riding motorcycles approach the cliffside overlooking Midgar and Edge, beside the Buster Sword. Their names are revealed to be Yazoo (Dave Wittenberg), Loz (Fred Tatasciore), and Kadaj (Steve Staley), Kadaj appearing to be their leader and also the man shown in the opening scene. The three discuss finding their \"big brother\" (Cloud) and their \"mother\" (JENOVA).\n\nThe protagonist Cloud Strife is shown riding on a motorbike in the wasteland before he is ambushed by Yazoo and Loz. The two summon Shadow Creepers to attack Cloud as well as attack him themselves. Cloud reveals that his motorbike has hidden compartments that hold his various swords. However, as they fight, Cloud is distracted by a pain in his left arm. It is later revealed that Cloud has contracted Geostigma. Cloud is overwhelmed, but Kadaj calls Yazoo and Loz back before Cloud is finished off.\n\nCloud then rides into the outskirts of Edge to find the mysterious caller. As he enters the building, Reno attempts to attack him. Cloud easily blocks the attack with one of his swords and locks Reno outside the building. The man in the wheelchair enters the room, accompanied by another Turk: Rude (Crispin Freeman). The man is then revealed to be Rufus Shinra, who was the president of the Shinra company before it was destroyed. Rufus reveals that the Turks were sent to the Northern Crater to look for remains of Sephiroth, but were ambushed by the Remnants. Shinra's plan is to find the remaining JENOVA cells before the Remnants do, or there is a chance that Sephiroth may be reborn. Geostigma is also suspected to have been caused by Sephiroth's soul, acting through the Remnants and his soul living in the Lifestream. Rufus offers Cloud the chance to help fix Shinra's mistakes and restore the Planet to what it was before Meteor, and also for protection from Kadaj's gang. Cloud however, refuses.\n\nThere is a short scene of Tifa and Marlene visiting the church in the Sector Seven slums of Midgar, where Aerith Gainsborough (Mena Suvari) used to be. It is revealed that Cloud is now living in the Church. The two stay in the church and wait for Cloud to arrive.\n\nKadaj has managed to infiltrate the building and defeat Reno and Rude alone. Rufus states that Kadaj and the Remnants are looking for \"an object\", which he says fell from the Turks helicopter as they fled the Northern Cave. Kadaj then displays the ID cards of Tseng and Elena, smeared with blood. Kadaj then explains the Reunion, which he says is an event in which his \"brothers and sisters\" will join with him, and they will take revenge on the Planet, and that the Geostigma are \"invitations\". He mentions that the Remnants can never be \"whole\" unless they receive JENOVA's cells. Kadaj then shows proof that he is in fact a reincarnation of Sephiroth by using Rufus's memories.\n\nCloud is shown on the cliff with the Buster Sword. A flashback of the events in Crisis Core: Final Fantasy VII are then shown.\n\nLoz enters the church in the slums, saying that he is looking for \"mother\". When Tifa says that there is no one there, Loz attempts to take Marlene with him. Tifa retaliates, fighting Loz while displaying an impressive array of physical attacks. However, even after the fight, Loz remains unfazed and uses a device on his arm to disarm Tifa and to knock her unconscious.\n\nA girl living in Edge meets Denzel, and mentions that a group of people are going to \"fix\" the children affected by Geostigma. All the children, including Denzel, board the back of a pickup truck as Yazoo is revealed to be the leader of the operation.\n\nCloud then enters the church and notices the unconscious Tifa. Tifa awakens and tells Cloud that Loz took Marlene before she drops unconscious again. Cloud then notices a searing pain in his arm as black slime drips from the Geostigma bruise and onto the flowers in the church. A quick sequence of images are shown, several of them with Sephiroth in them. The pain subdues Cloud and knocks him unconscious as well.\n\nCloud wakes up in an inn, rescued by Reno and Rude. The two tell Cloud that the Remnants have kidnapped the children and taken them to an unknown location. When asked if he cares or not, Cloud does not reply.\n\nMeanwhile, the Forgotten City, Kadaj inspects a chest taken from the church by Loz. The chest is revealed to contain Materia linked with the power of the Lifestream. Kadaj takes the Materia, saying that \"those powers will now be theirs\".\n\nTifa wakes up in the inn and attempts to convince Cloud to fight the Geostigma together with the children, instead of just giving up. Cloud reacts by saying that he can no longer help anyone, overridden with guilt. Reno and Rude then enter the room and reveal the location of Kadaj: the Forgotten City. Cloud sets off to find the children.\n\nKadaj can be seen overlooking a small river with the children waiting on the other side. Kadaj tells the children that their \"mother\" has given them the gift to fight against the Planet. He says that they are destined to inherit JENOVA's legacy through the Lifestream. However, the Planet does not approve, and is fighting back through Geostigma. Kadaj now tells the children that he will heal them, and steps into the river, tainting it with JENOVA's presence. The children are told to then drink the water, and they comply, including Denzel.\n\nAs he rides through the Forgotten Forest, the deceased Aerith uses the Lifestream to contact him. She asks Cloud why he came to the Forest. Cloud responds by saying that he just wants to be forgiven. When Aerith asks by who, the scene ends and Cloud returns to riding his motorbike through the Forest. Gunshots suddenly erupt as bullet fly past Cloud. In front of him, he notices the Remnants, firing at him from a distance. With the added power of the Materia, the Remnants are more powerful. Kadaj signals, and the children drop down from the trees above, now brainwashed and under Kadaj's control. Cloud is forced to stop to avoid hitting the children, and falls off the motorbike. Cloud and the Remnants then fight in the Forest. Cloud appears to be overwhelmed from the very start, outnumbered three to one. With their Remnant synchronization, the three men quickly subdue Cloud. However, Vincent Valentine (Steve Blum), an old friend of Cloud, appears and saves Cloud, taking him away to another part of the Forest. Cloud drops his cell phone in the process.\n\nVincent explains that the Geostigma is the result of an infection brought about by the soul of JENOVA attacking the bodies of the children through the Lifestream. If the Remnants managed to obtain JENOVA's cells, they could recreate Sephiroth. Marlene appears from the bushes, telling Cloud that she managed to escape from Kadaj while they were fighting. Cloud tells Vincent to take Marlene back to Edge while he goes to talk to Rufus, but Vincent denies. Marlene becomes fed up with Cloud, asking why he never cared about them. Cloud reflects on his past conversations with Tifa on the same topic, realizing that fighting alone isn't going to get anywhere. Cloud then agrees to take Marlene to Edge.\n\nThe next scene shows Cloud's cell phone falling to the bottom of a small pond, while the numerous messages from his friends are being played. As the phone reaches the bottom, a message from Aerith plays, saying that she never blamed him for anything. The screen then turns black.\n\nMeanwhile in Edge, Yazoo and Loz have surrounded the Midgar monument with the still-brainwashed children, watching as the citizens protest. Annoyed, Yazoo summons the Shadow Creepers to drive away the citizens. In the chaos, Tifa finds the brainwashed Denzel standing in the circle, who does not respond to her. On the other side of the circle, Yazoo and Loz begin to tear down the monument, believing that JENOVA's cells are hidden within. Reno and Rude show up, ready for battle. Yazoo taunts them about not being trusted by Rufus, and Reno responds by attacking.\n\nThe scene flashes to Kadaj conversing with Rufus on the same building as in the opening scene. Kadaj explains that Sephiroth is returning, and it will not be long before the reunion arrives. He also explains that he must be the one to make the Planet accept JENOVA, in order to make his \"mother\" happy. However, it is also mentioned that Kadaj may be slightly jealous of Sephiroth for his relationship with JENOVA. Kadaj then uses the new Materia to fire a Summon into the sky, summoning Bahamut SIN, which he believes will end all the chaos.\n\nAs Bahamut SIN approaches the Midgar monument, the crowd begins to retreat. Tifa continues to talk to Denzel, but he still does not respond. Reno and Rude notice the giant dragon and attempt to save the children by carrying them away from the monument. However, Bahamut SIN uses an blue energy blast to destroy the monument, causing an explosion that knocks Reno and Rude to the ground. Yazoo and Loz continue to fight Reno and Rude. During the fight, Yazoo mentions that all they want \"is to be with mother\". The two Remnants overpower the Turks quickly. They continue to fight.\n\nDenzel, whose own mind was restored by the blast, wakes up from unconsciousness and sees Tifa still unconscious. In an angry rage, he charges towards Bahamut SIN, however, Barret Wallace (Beau Billingslea), shows up behind him and stops him, while using his machine-gun arm to fire at Bahamut SIN. Other friends of Cloud and Tifa show up as well, including Yuffie Kisaragi (Christy Carlson Romano), Cid Highwind (Chris Edgerly),Vincent Valentine, Red XIII, and Cait Sith (Greg Ellis). Cloud also rides in on his motorbike, saying that he feels \"lighter\".\n\nAs the group fights Bahamut SIN, Cloud enters the battle and fights the dragon himself, using two swords. All of his attacks appear to have no effect, until Cloud uses his Braver limit to knock the dragon down to the ground. However, Bahamut SIN begins to charge a massive blue energy blast and flies up high into the sky.\n\nMeanwhile, Kadaj is still talking with Rufus on the building. Rufus then stands up, revealing that he is not crippled at all, and removes the white cloth, revealing his true identity to Kadaj. Kadaj stares in complete shock at the black box in Rufus's hand. Rufus was in possession of the JENOVA cells all along, which he quickly tosses over the edge of the building, saying \"A good son would have known.\". Kadaj screams in agony as he launches a blast at Rufus.\n\nCloud manages to reach the dragon's height with the help of his friends just as Bahamut releases the massive blast. Cloud enters the blast and attempts to reach the other side. The spirit of Aerith appears from the Lifestream and helps Cloud reach the other side of the blast and charge at Bahamut SIN. Cloud uses his Climhazzard limit to finish off the dragon as the blast crashes harmlessly into a construction area.\n\nAs Cloud lands, Kadaj launches an energy blast at Rufus, who intentionally falls off the building. Rufus then retrieves a gun from his pocket and begins to fire at Kadaj, who also jumps off the building. Kadaj manages to fall faster than Rufus, and desperately tries to retrieve the JENOVA cells before they hit the ground. However, one of Rufus's bullets hits the box, tearing it open and spilling several of the greenish cells. Elena and Tseng then appear and launch two nets through the air, which catch the falling Rufus. Kadaj safely lands in front of Yazoo, Loz, Reno, and Rude.\n\nKadaj then spots Cloud speeding towards them on his motorcycle. Him, Yazoo and Loz board their own motorcycles and take off towards the uncompleted highway just as Cloud follows them in a chase.\n\nAs Cloud desperately tries to catch up to Kadaj, Yazoo and Loz distract him by attacking. Eventually, Kadaj takes a ramp to the higher levels. Cloud tries to follow, but is cut off by Loz and is forced to stay on the lower levels. Cloud, Yazoo and Loz enter a sealed overpass, in which they attack Cloud brutally. Cloud however, manages to destroy Loz's motorcycle and both of their weapons, using two of his swords. Cloud speeds ahead as Loz boards Yazoo's motorcycle.\n\nReno and Rude take positions in front of the three as they set up explosives on the highway. Cloud drives past both of them, but Yazoo and Loz are caught in the gigantic explosion. The explosion propels Cloud to the higher levels and he engages Kadaj in battle. Eventually, the highway ends, and the two are sent flying into the ruins of Midgar.\n\nKadaj manages to lose Cloud in the ruins, and decides to stop in Aerith's church to examine the black box. Rufus's bullet tore a long crack in the side, and Kadaj peers through the hole and cries out in realizing that he has finally found his \"mother\". Cloud enters the church as Kadaj launches a blast at one of the pillars, knocking it down and using it as a ramp to ride to the higher floors. He launches another blast at Cloud, knocking him off his motorcycle. Kadaj prepares to finish him off, but Aerith uses the Great Gospel to call sacred water into the church, curing Cloud's Geostigma and causing Kadaj to flee, as the water harms JENOVA's cells.\n\nCloud follows the path where Kadaj fled, and eventually ends up in an open area in front of the ruined Shinra Headquarters, located in the heart of Midgar. Kadaj confronts Cloud, saying that \"mother will tell me what to do next\". Cloud responds by calling Kadaj a remnant, a puppet of JENOVA. Kadaj responds violently by attacking Cloud, saying that he was once a puppet too. The two fight among the ruins.\n\nEventually, the rest of Cloud's friends arrive via Cid's airship, the Sherra. Barret says that they should help Cloud, but Tifa says that the fight belongs to Cloud, and not to them. She also says that Cloud has recovered the strength that they had lost after the last battle with Sephiroth. The battle continues between Cloud and Kadaj.\n\nKadaj attempts a final attack, lunging at Cloud from above. Cloud uses the Finishing Touch limit to launch Kadaj into the air. Kadaj manages to hang onto the edge of a structure, but loses his sword in the process. Cloud approaches Kadaj, whose grip is slowly slipping. Kadaj tries a final attempt to stop Cloud by tossing the black box at him, which Cloud slashes. The box flies through the air, but has now opened. Kadaj launches himself upward and catches the box while falling down the valley. Kadaj retrieves the cells from within the box, saying that his reunion is finally here. Kadaj fuses with the cells as he continues to fall. Cloud jumps after him.\n\nKadaj somehow lands harmlessly, and Cloud brings down his sword. However, Cloud's sword has hit an invisible barrier, separating the sword from Kadaj, who has now fully transformed into Sephiroth. Sephiroth's long katana then appears, which is what blocked Cloud's attack. Sephiroth slashes Cloud, launching him upward through the air and onto a rooftop. Sephiroth jumps after him.\n\nSephiroth notices that Cloud's Geostigma is gone, and says that it is \"too bad\". He then tells Cloud that his only goal is to sail through the cosmos using the Planet as a vessel, just as JENOVA did long ago. Eventually, they will find a new planet, and will create a new future for humanity, leaving the old Planet in the hands of the people still on it. Cloud vows to stop him, and engages Sephiroth in a final battle.\n\nThroughout the entire battle, Sephiroth appears to have the upper hand, blocking every attack that Cloud uses. Eventually, Sephiroth tells Cloud that he has found a \"present\" for him, and leads him to the ruined Shinra Headquarters again. As Sephiroth slashes Cloud downward, Cloud uses two of his swords as ledges to stay on the building. Sephiroth uses unknown strength to split the Shinra building in half, and collapses the half down towards the two of them. The two continue to fight in the debris of the falling building. Cloud eventually decides to flee the scene, fleeing to another building and almost collapsing in exhaustion. Sephiroth continues to attack relentlessly, launching Cloud against the side of a building and stabbing him in the shoulder, pinning him against the surface.\n\nSephiroth then tells Cloud to tell him what he cherishes most, so that he may take it away from him. Cloud calls upon his friend's memories and pulls out the sword, diving into the air and tells Sephiroth that he cherishes everything. Cloud then uses his new technique, the Omnislash Version 5, to defeat Sephiroth. Before Sephiroth fades, he tells Cloud that he will never be just a memory, and transforms back into the defeated Kadaj.\n\nKadaj attempts to attack Cloud again, but loses his strength and collapses. Aerith then calls out the Kadaj, telling him that everyone is waiting for him. Kadaj then joins the Lifestream, dissolving in a green stream. Sacred rain begins to fall from the sky, curing everybody in the city of Geostigma. However, as Cloud looks up to the sky, a bullet suddenly pierces his body, and he collapses. The camera shifts to expose the fading Yazoo, who fired the bullet. Loz is beside him, also fading away because of the rain. Using the last of his strength, Cloud charges at the two. Yazoo and Loz then overcharge their Materia, causing a massive explosion. Cloud's friends watch from the airship in horror as Cloud is caught in the blast and killed.\n\nThe scene fades to Cloud's body floating in the Lifestream, as the wolf representing Cloud's guilt, fades away. The voices of Aerith and Zack Fair (Rick Gomez), Cloud's old friend, are heard. Aerith decides that Cloud isn't ready to die yet, and revives him. Cloud wakes up in the church, where a pool of sacred water has collected. All of Cloud's friends are there, including several of the citizens of Edge, and all the children. Red XIII tells Cloud that Denzel is still infected with Geostigma, due to him being indoors during the Great Gospel. Tifa then brings Denzel, who is still scared because of his previous experience with \"sacred water\", to the pool. Cloud then pours the water over Denzel's head, curing his Geostigma. Everybody rejoices as Cloud looks at the entrance of the church, where the spirits of Aerith and Zack are seen. Before they leave, Aerith tells Cloud that everything is now alright. Cloud acknowledges, and says that he finally realizes that he is not alone.",
        "director": "Tetsuya Nomura"
    },
    {
        "imdb_id": "550315",
        "title": "Fireman Sam: Set for Action!",
        "release_date": "2018-09-27",
        "duration": 62,
        "ave_rate": "0.0",
        "poster_path": "/2atmRsuSA4tX6sbOEgFzquFWcCV.jpg",
        "backdrop_path": "/dT9QkNJ1SXZRRQ7u8z7Sn1O2bBc.jpg",
        "origin_country": [
            "GB",
            "US"
        ],
        "summary": "The alarm has sounded and the Pontypandy crew is off to rescue their friends and others in need. From engine sparks and wild fireworks to water rescue and more, you won't want to miss these adventures with your favorite hero, Fireman Sam!",
        "revenue": 1996326,
        "budget": 0,
        "genres": [
            "Family",
            "Animation",
            "Action",
            "Adventure"
        ],
        "synopsis": "",
        "director": "Clint Butler"
    },
    {
        "imdb_id": "19386",
        "title": "He-Man and She-Ra: The Secret of the Sword",
        "release_date": "1985-03-22",
        "duration": 87,
        "ave_rate": "0.0",
        "poster_path": "/iPU6h1EVljeoqIL5fZx4kSsXwLx.jpg",
        "backdrop_path": "/1jSJMUigYZXVmIBARQxwU8rzArr.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "After experiencing traumatic nightmares of a time now past, the Sorceress summons Prince Adam and Cringer to Castle Grayskull to give Adam a precious, jeweled sword and send the pair to the planet Etheria to investigate its secrets.",
        "revenue": 7,
        "budget": 0,
        "genres": [
            "Animation",
            "Action",
            "Adventure",
            "Family",
            "Fantasy"
        ],
        "synopsis": "",
        "director": "Lou Kachivas"
    },
    {
        "imdb_id": "54797",
        "title": "Ill Met by Moonlight",
        "release_date": "1957-01-31",
        "duration": 104,
        "ave_rate": "0.0",
        "poster_path": "/8UAkOYzZ1qg1KkevvHQ6kK9XGn3.jpg",
        "backdrop_path": "/acVsRJUJIRrBlFarElklGYb5tvt.jpg",
        "origin_country": [
            "GB"
        ],
        "summary": "Led by British officers, partisans on Crete plan to kidnap the island's German commander and smuggle him to Cairo to embarrass the occupiers.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "War",
            "Adventure",
            "Action"
        ],
        "synopsis": "",
        "director": "Michael Powell"
    },
    {
        "imdb_id": "425505",
        "title": "Kin",
        "release_date": "2018-08-29",
        "duration": 102,
        "ave_rate": "0.0",
        "poster_path": "/oPE5GXHaTlu5eRcd4USuOX3A1mf.jpg",
        "backdrop_path": "/aMCemu5HAADo7hYzxK5DUZq5nF9.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "A young boy finds a powerful otherworldly weapon, which he uses to save his older adoptive brother from a crew of thugs. Before long, the two of them are also pursued by federal agents and mysterious mercenaries aiming to reclaim their asset.",
        "revenue": 10023153,
        "budget": 30000000,
        "genres": [
            "Science Fiction",
            "Action",
            "Adventure",
            "Thriller"
        ],
        "synopsis": "",
        "director": "Jonathan Baker"
    },
    {
        "imdb_id": "464038",
        "title": "Mobile Suit Gundam: The 08th MS Team - Miller's Report",
        "release_date": "1998-08-01",
        "duration": 55,
        "ave_rate": "0.0",
        "poster_path": "/fdFxuckun446PsbjhfeunhgKeLF.jpg",
        "backdrop_path": "/dhZzWxSTC5YdQrBsVEMzYEG9d8F.jpg",
        "origin_country": [
            "JP"
        ],
        "summary": "Universal Century 0079. The One Year War rages on, and Shiro Amada and his unit, the 08th MS team, continue their struggle against Zeon forces in the jungles of Southeast Asia. But recent events have put them under close scrutiny by Federation leaders. Alice Miller, an officer of the Federation Intelligence Division, has been dispatched to ascertain the truth behind a series of events leading to the capture of a new enemy mobile armor. As she begins her investigation, the lines between Federation and Zeon become blurred. Is there really a spy among the 08th MS team?",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Animation",
            "Action",
            "Science Fiction",
            "War"
        ],
        "synopsis": "",
        "director": "Takeyuki Kanda"
    },
    {
        "imdb_id": "23260",
        "title": "My Pal Trigger",
        "release_date": "1946-07-10",
        "duration": 79,
        "ave_rate": "0.0",
        "poster_path": "/r43vTerV00xpJZuFlKRH0ZPlnpG.jpg",
        "backdrop_path": "/Af3XTAjk85qXIvbHshdLUeZZpQp.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "Gabby doesn't want to breed his horse the Golden Sovereign with Roy's. When Sovereign and Roy's horse escape, the Sovereign gets shot accidentally by Skoville but Roy is blamed and jailed. A year later Roy returns with Trigger, the son of the Sovereign. When Skoville reveals he was present when the horse was shot, Roy sees an opportunity to clear his name.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Western",
            "Music"
        ],
        "synopsis": "",
        "director": "Yakima Canutt"
    },
    {
        "imdb_id": "229979",
        "title": "Necessary Evil: Super-Villains of DC Comics",
        "release_date": "2013-10-23",
        "duration": 99,
        "ave_rate": "0.0",
        "poster_path": "/5dpgzyJvwDTXYN6ZPsA3w5yzlNY.jpg",
        "backdrop_path": null,
        "origin_country": [
            "US"
        ],
        "summary": "A documentary detailing the epic Rogues' Gallery of DC Comics from The Joker and Lex Luthor, Sinestro, Darkseid and more, this documentary will explore the Super Villains of DC Comics.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Documentary",
            "Action",
            "Crime"
        ],
        "synopsis": "",
        "director": "J.M. Kenny"
    },
    {
        "imdb_id": "46343",
        "title": "Oktapodi",
        "release_date": "2008-05-31",
        "duration": 2,
        "ave_rate": "0.0",
        "poster_path": "/2DFjdPQuv9Ryo1psjj02FgixG6Y.jpg",
        "backdrop_path": "/nzAjDOm8yzgTeCZQN1sjwjCGuyB.jpg",
        "origin_country": [
            "FR"
        ],
        "summary": "Two Octopi fight for their lives with a stubborn restaurant cook in a comical escape through the streets of a small Greek village.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Animation",
            "Comedy",
            "Family",
            "Action"
        ],
        "synopsis": "",
        "director": "François-Xavier Chanioux"
    },
    {
        "imdb_id": "644714",
        "title": "On the Line",
        "release_date": "2021-09-15",
        "duration": 109,
        "ave_rate": "0.0",
        "poster_path": "/iAgLm2YXhps0UOt90CJYeKbPydM.jpg",
        "backdrop_path": "/jr3ockzVPmXOD5Tf11lUMpgu20a.jpg",
        "origin_country": [
            "KR"
        ],
        "summary": "Seo-joon, loses everything to voice phishing and infiltrates a organization in China to meet Kwak Pro, the designer behind this phishing system.",
        "revenue": 11772156,
        "budget": 0,
        "genres": [
            "Action",
            "Crime",
            "Drama"
        ],
        "synopsis": "",
        "director": "Kim Gok"
    },
    {
        "imdb_id": "16353",
        "title": "Ong Bak 2",
        "release_date": "2008-12-04",
        "duration": 98,
        "ave_rate": "0.0",
        "poster_path": "/sGyB8kVPQsofyQV1T0jE2d6k4q4.jpg",
        "backdrop_path": "/3ZH69oLWaAmnR0WNGnTQkituwSF.jpg",
        "origin_country": [
            "TH"
        ],
        "summary": "Moments from death a young man is rescued by a renowned warrior. Realizing unsurpassed physical potential in the young boy he trains him into the most dangerous man alive. As he becomes a young man he goes on a lone mission of vengeance against the vicious slave traders who enslaved him as a youth and the treacherous warlord who killed his father.",
        "revenue": 8936663,
        "budget": 8500000,
        "genres": [
            "Adventure",
            "Action",
            "Thriller"
        ],
        "synopsis": "Set in the regal times of King Naresuan, Tien (Tony Jaa) is a man who was born into nobility but had it stripped from him after his parents were brutally murdered. During his childhood Tien learned Khon, a form of dance which is usually reserved for royalty. Although he didn't know it yet, Khon would later prove to be an invaluable aide to him. After seeing his parents murdered at the tender age of 10, Tien is forced to live on the streets where he is eventually captured by a group of thieves who take him in and teach him how to steal and fight.\n\nTien's expertise as a thief and fighter grows and it isn't long before he is made head thief. Then Tien sees something that makes his stomach churn. A competition is being held to find the best knights to serve under the very man who had killed Tien's parents all those years ago. Tien passes the tests easily and is made Lord Rachasana's 2nd Knight. Now, he has his opportunity to strike but he will have to use all his skill and ingenuity if he is going to get his revenge on the man who killed his parents.",
        "director": "Tony Jaa"
    },
    {
        "imdb_id": "46188",
        "title": "Peter Pan",
        "release_date": "1988-06-23",
        "duration": 48,
        "ave_rate": "0.0",
        "poster_path": "/x3068r7upUZru100Px4iY7xHwGE.jpg",
        "backdrop_path": "/uU1NiZL4WnciDPBJff5Dz6mmiU6.jpg",
        "origin_country": [
            "AU",
            "US"
        ],
        "summary": "This animated fairy tale for kids tells the classic story of Peter Pan, the boy who never grew up. Determined never to become an adult, Peter stays forever young in a magical word called Neverland, where he leads a band of mischevious kids called the Lost Boys. Unfortunately, Neverland's chief other inhabitant is a pirate named Captain Hook, who would like nothing more than to put a permanent end to Peter's fun.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Adventure",
            "Animation",
            "Family",
            "Fantasy",
            "Science Fiction"
        ],
        "synopsis": "",
        "director": "David Cherkaskyi"
    },
    {
        "imdb_id": "14411",
        "title": "Sinbad: Legend of the Seven Seas",
        "release_date": "2003-07-02",
        "duration": 90,
        "ave_rate": "0.0",
        "poster_path": "/mtkPe9AMiXloYPCsldSbxKuXXWJ.jpg",
        "backdrop_path": "/1Q1tAM49hoT3Hsj2kpx8O34kG01.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "The sailor of legend is framed by the goddess Eris for the theft of the Book of Peace, and must travel to her realm at the end of the world to retrieve it and save the life of his childhood friend Prince Proteus.",
        "revenue": 80767884,
        "budget": 60000000,
        "genres": [
            "Family",
            "Animation",
            "Adventure",
            "Comedy",
            "Fantasy",
            "Action"
        ],
        "synopsis": "Sinbad, Legend of the Seven Seas\n\n(This film is an animation, therefore the voice actors are named)\n\nEris (1), Goddess of Discord (Michelle Pfeiffer), wishes to ruin the Twelve Cites, currently protected by the magical powers of the Book of Peace. The Book is being transported by ship to a new home, a tower in Syracuse, by Prince Proteus (2) (Joseph Fiennes) of Syracuse, only son of King Dymas (Timothy West): however he is followed and attacked by his childhood friend Sinbad (Brad Pitt) and his crew, which includes his lieutenant Kale (Dennis Haysbert), look-out Rat (Adriano Giannini), oriental twins Jin (Raman Hui) and Li (Chung Chan), and elderly Jed (Conrad Vernon) who wish to seize the Book for ransom. Eris sends a kraken-like sea-monster, Cetus (3), to attack both ships: this is defeated by Proteus and Sinbad, but Sinbad, washed overboard as the monster sinks, is met by Eris, who tries to persuade him to steal the Book for her and bring it to her realm of Tartarus (4), for a far greater reward: a tale laughed at by his crew when Sinbad tries to tell them.\n\nProteus brings the Book safely to Syracuse. At the celebratory feast, which Sinbad and his crew gatecrash, Sinbad is confronted with Marina (Catherine Zeta-Jones), Proteus' fiancée, and his own secret love: he leaves abruptly. Eris breaks into the Book's tower, and, assuming the form of Sinbad, overpowers the guard (Chris Miller) and steals it, leaving Sinbad's knife behind. Immediate decay and disaster overwhelms Syracuse: Sinbad, arrested, is tried and condemned to death for stealing the Book, despite his tale about Eris. Proteus, however, believes Sinbad, and offers himself in Sinbad's place as a condemned prisoner so that Sinbad can rescue the book - for which he has just ten days.\n\nSinbad, back on his ship (the Chimera (5)), has however no thought except to retire to Fiji: he knows Dymas will not allow Proteus to be executed (although when Dymas later engineers Proteus' escape, Proteus refuses). Marina however bribes her way on board ship and then bribes Sinbad with a bagful of jewels to make the journey to Tartarus - although she is not very happy when told she'll be bunking up with Sinbad's drooling dog, Spike.\n\nThe first danger of the journey is the savage rocks and passage of the Dragons' Teeth, to which Eris adds a special touch; mer-music, from malicious mermaid-like water-spirits, sirens (6), whose singing entrances the male crew and tries to persuade them to cast themselves overboard. Marina, unaffected, is left to steer the ship through the hazardous rocks whilst also trying to save the crew; with Spike's help she manages this, but at some damage to the ship, about which Sinbad is annoyed.\n\nTo repair the damage, the ship stops at a wooded isle, where the tension between Sinbad and Martina results in a mud-slinging match: this awakens the isle, which is really a giant fish. Everyone hurries back on board ship, and Sinbad manages to attach a harpoon and rope to the fish so that they are rapidly towed in its wake towards Tartarus. One very bumpy night afterwards, when everyone is feeling sick, Sinbad releases the rope: they have now appeared at the Granite Gates, a huge ruin of monoliths. Sinbad tells Marina how he and Proteus met as children, but evades the question of why they parted.\n\nEris once again intervenes, freezing the entire area so that Sinbad's ship is trapped in ice, and releasing a white Roc (7) to harry the crew: this carries off Martina to the top of the ruins, and Sinbad has to climb to rescue her, which they do by sliding down the mountain on his shield like a snow-board. The collapsing Gates kill the Roc, smash the ice and free the ship: Sinbad now reveals his love for Marina.\n\nApproaching the gates of Tartarus, Rat sees that these lie beyond the edge of the world, a huge waterfall: Sinbad re-rigs the ships sails to fly it in the up-draught beyond the falls so that he and Martina can swing on a rope through the gates into Tartarus.\n\nIn Tartarus, Eris meets them and her full plan, not only to steal the Book but to engineer Proteus' execution, thus causing widespread chaos, is revealed. She offers Sinbad a deal, to which she binds herself: he can have the Book if he answers, truthfully, what he will do if he does not get it - will he take Marina to Fiji, or will he go back to Syracuse to face execution? He answers the latter, but Eris decides he is lying, and throws both him and Martina out of Tartarus without the Book. Marina, in love with Sinbad, tries to persuade him to run away.\n\nBack at Syracuse, the ten days are up, and Proteus is about to be executed when Sinbad returns and takes his place. Since he can now be seen not to have lied, Eris, enraged, is bound to return the Book to him - which she does, and Syracuse is restored. Proteus realizes he has lost Martina to Sinbad, and she joins him on his ship, to search for new adventures.\n\nOn the DVD there is an additional post-tale episode with Sinbad and Martina on the isle of Krakatoa, inhabited by numerous blue furry Cyclops: there is a battle between these and the crew, but then Sinbad accidentally triggers a volcanic eruption, and the island sinks.\n\nNotes: (1) Mythically, Eris is indeed the Greek goddess of discord (2) Mythically, Proteus was a Greek sea-god capable of changing his form (3) Mythically, Cetus is the sea-monster usually associated with Andromeda, daughter of Cassiopeia, rescued by Perseus: it is an associated constellation (sometimes called the Whale) in the northern sky. (4) Mythically, Tartarus is the hellish part of the Greco-Roman Underworld, in which the Gods imprisoned the Titans, and where those who offended the Gods, such as Ixion, Tantalus and Sisyphus, undergo eternal punishment. (5) Mythically, the Chimera was a creature part-lion, part-goat, and part-serpent, killed by Bellerophon (6) Mythically, the Sirens were between two and five monsters, part women and part bird, who lured sailors to their death by their singing. (7) The roc or rukh is a giant bird in Persian mythology, probably inspired in part by the eggs or even sightings of Aepyornis maximus, the elephant bird, a now-extinct three-metre-tall flightless bird of Madagascar, for which there were reported sightings at least in folklore memory recorded in 1658. The eggs were known at least as early as 1420, according to a caption in the 1456 Fra Mauro map: Marco Polo also gave an account of the rukh in 1298.",
        "director": "Patrick Gilmore"
    },
    {
        "imdb_id": "371042",
        "title": "Snowflake",
        "release_date": "2017-09-14",
        "duration": 120,
        "ave_rate": "0.0",
        "poster_path": "/hgPfBH12qth3xaz5r3zQhH1c8oS.jpg",
        "backdrop_path": "/3EhEkWjcHfgVHkMEfKVjOqJQDip.jpg",
        "origin_country": [
            "DE"
        ],
        "summary": "Hunting down the murderer of their families in an anarchic Berlin of the near future, the outlaws Tan and Javid find themselves trapped in the wicked fairytale of a mysterious screenplay that entangles them in a vicious circle of revenge – apparently all written by a clueless dentist.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Fantasy",
            "Comedy",
            "Crime",
            "Thriller"
        ],
        "synopsis": "",
        "director": "William James"
    },
    {
        "imdb_id": "474395",
        "title": "Teen Titans Go! To the Movies",
        "release_date": "2018-07-27",
        "duration": 84,
        "ave_rate": "0.0",
        "poster_path": "/mFHihhE9hlvJEk2f1AqdLRaYHd6.jpg",
        "backdrop_path": "/1SjsVcGO2T2cCrhlhXi8gxQl7jx.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "All the major DC superheroes are starring in their own films, all but the Teen Titans, so Robin is determined to remedy this situation by getting over his role as a sidekick and becoming a movie star. Thus, with a few madcap ideas and an inspirational song in their hearts, the Teen Titans head to Hollywood to fulfill their dreams.",
        "revenue": 28646544,
        "budget": 10000000,
        "genres": [
            "Animation",
            "Action",
            "Comedy",
            "Science Fiction"
        ],
        "synopsis": "",
        "director": "Aaron Horvath"
    },
    {
        "imdb_id": "16237",
        "title": "Teen Titans: Trouble in Tokyo",
        "release_date": "2006-09-15",
        "duration": 75,
        "ave_rate": "0.0",
        "poster_path": "/4wMlDE1HzkVyYeDKuY1oDOWQlN2.jpg",
        "backdrop_path": "/fey7NzJ61KAAVPfUgcpaahW5gZ5.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "America's coolest heroes Teen Titans head to Japan as they spring into action when a new threat, the dichromatic ninja Saico-Tek, appears in their city. A chase across the city ensues, ending at Titans Tower. Saico-Tek is interrogated by Robin with the aid of a translation program, and reveals the identity of the one who sent him. The ninja then escapes his bonds and vanishes after destroying a fire sprinkler, and the Titans' only lead is to search for his mysterious master - the shadowy figure known as Brushogun.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Animation",
            "Action",
            "Science Fiction",
            "TV Movie"
        ],
        "synopsis": "",
        "director": "Ben Jones"
    },
    {
        "imdb_id": "382638",
        "title": "Terrordactyl",
        "release_date": "2016-04-25",
        "duration": 98,
        "ave_rate": "0.0",
        "poster_path": "/M7Ocrcowx7JrYRV3sDrIgTKZXx.jpg",
        "backdrop_path": null,
        "origin_country": [
            "US"
        ],
        "summary": "When a meteor shower rains down outside Los Angeles, Jonas and Lars, two friends stuck in tired, boring lives, head out to find a meteor and strike it rich. After recovering one, they start being stalked by terrordactyls, ancient flying reptiles that launch a full-on assault on the city. Trying to survive, they go on the run...",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Comedy",
            "Science Fiction"
        ],
        "synopsis": "",
        "director": "Geoff Reisner"
    },
    {
        "imdb_id": "20174",
        "title": "The Fast and the Furious",
        "release_date": "1954-11-01",
        "duration": 74,
        "ave_rate": "0.0",
        "poster_path": "/731NMB4a85McIYcftPtbH4D3l5x.jpg",
        "backdrop_path": "/8asUJMTcr1KEfbGtpZhESI0I7X6.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "A framed man escapes prison and takes a wealthy woman's Jaguar with her in it. After she tries to escape numerous times, they begin to develop feelings for each other, and enter a road race that ends in Mexico.",
        "revenue": 250000,
        "budget": 66000,
        "genres": [
            "Action",
            "Crime",
            "Drama"
        ],
        "synopsis": "In the opening scene, a helmeted racer leads a gang of stunt drivers driving three black Honda Civic coupes who hijack a shipment of electronics from a moving truck.\n\nBrian O'Conner (Brian Walker) is an undercover police officer, driving supercharged cars and trying to infiltrate Dominic Toretto's (Vin Diesel) gang, who are suspects in the robberies. He first visits Dominic's cafe, where he makes conversation with Dominic's younger sister, Mia (Jordana Brewster) and tries to make inroads with the gang by selling performance equipment. Vince (Matt Schulze) is jealous, and a fight breaks out. His girlfriend Letty (Michelle Rodriguez) begs Dom to break it up, who does so, threatening to get Brian fired.\n\nThat night, racers gather for street racing. Brian meets Hector (Noel Gugliemi), and they wait for Dom. Brian offers his car in a bet, and Dom's tech Jesse (Chad Lindberg) checks his car out. The spectators line the streets, lighting the way. Brian and Dom race with Johnny Tran (Rick Yune) and Edwin (Ja Rule). Dom wins, showing Brian superior driving and timing. The racers pick up a police alert on the scanner, and everyone flees. Dom parks his car and flees on foot, and Brian helps him escape. Dom has researched Brian (getting his cover story), but as they chat, they are surrounded by uzi-wielding Chinese bikers, who escort them to an empty lot. The leader of this gang, Johnny Tran, admires Brian's car and refers to a race in the desert next month. He and his goons shoot up Brian's car, which explodes from the NOS (Nitrous Oxide) on board.\n\nBack at Dom's house, a party is in progress. Dom yells at his gang, saying Brian was the only one to help him. Vince is upset that Brian is back, and Mia breaks up with him.\n\nThe next day Brian arrives at a police safehouse where his boss, Sgt. Tanner (Ted Levine), briefs Brian. Truckers are getting nervous about the robberies, and the FBI are now involved. They keep hearing about modified Honda Civics in the robberies. Later that day, Brian brings Dom a wrecked Toyota Supra with a powerful engine, and starts working in Dom's garage. Vince continues to be angry with Dom's friendship with Brian, and Mia teases him.\n\nThe next day, Hector buys parts for Honda Civics from Brian, and Brian gets suspicious. He breaks into Hector's garage, but Vince and Dom have followed him. Brian convinces them he's spying on the competition for Race Wars next month. Vince is suspicious, but Dom thinks it's a good idea, and they break into Tran's garage. Brian spots possible stolen goods. Tran and his goons arrive, and Dom, Brian and Vince watch as they torture local fence Ted (Beau Holden) about stolen engines.\n\nBrian tells the FBI, but wants to resist moving in on Tran until they have more evidence. His boss thinks he's too soft on Torretto; that Brian is going \"native\".\n\nThe next day, Dom takes Brian into confidence and shows off his supercharged 1970 Dodge Charger, one he never drives. Dom says it has too much power.\n\nOver dinner, Brian and Mia talk about Dom, then Mia shows off her driving skills. At the same time, another robbery is in progress, and Brian gets a call from his boss that they are moving in on Tran in the morning. The raid goes off with Brian wearing a hood (to avoid recognition), but Tran's gang gets out for lack of evidence - the suspicious goods were purchased. Sgt. Tanner cautions Brian about falling for Mia, and tells him Dominic is the next suspect.\n\nThe next day, Brian and Dom take the rebuilt Supra for a spin, and smoke a Ferrari. Over lunch, Brian asks to get in on Dom's next job, but Dom wants to see how Brian does at Race Wars first.\n\nIn the middle of the desert, Race Wars begins. Letty wins, but Jesse loses his car to Tran and refuses to pay. Tran accuses Dom of being an informer as a result of the police raid on his place the day before, and a fight breaks out.\n\nThat night, Mia is upset with Dom, who is obviously going on another robbery (revealing that Dom and his gang really are the hijackers that Brian is trying to nail all along). Brian confesses that he's a cop, and asks Mia to help him warn Dom about the truckers arming themselves and the FBI operations. Brian calls for a trace of Dom's cell phone. Letty is nervous about the upcoming job, but they go ahead with it.\n\nAt the climax, Dom and his gang don their masks and cars and set out for another hijacking job. The robbery begins to go wrong when Vince jumps on the truck, but is shot at by the trucker. Letty crashes her car, and Leon (Johnny Strong) rescues her. Brian arrives on the scene and risks his life to save Vince as the trucker reloads his shotgun. Dom arrives and hears Brian calling for a medical helicopter, identifying himself as a cop. Dom is stunned, but Vince is the first priority. After Vince is stabilized, Dom storms off with Mia following.\n\nBack at Dom's house, Brain confronts Dom. Jesse returns, and Tran shoots him in a drive-by. Brian gives chase, and Dom gets in the Charger to pursue as well. Dom stops in front of one of the motorcycles, sending the goon into a field, and Brian shoots Tran. Brian sees Dom fleeing, and pursues in the Supra. They race, and Dom's car begins destroys itself from the massive torque in the motor. They finish the race, but Dom hits a truck pulling out from a side street. The Charger is wrecked, and Dom is injured. As the police sirens are heard in the distance, Brian gives Dom his car and Dom escapes.",
        "director": "Edward Sampson"
    },
    {
        "imdb_id": "961",
        "title": "The General",
        "release_date": "1926-12-25",
        "duration": 79,
        "ave_rate": "0.0",
        "poster_path": "/nIp4gIXogCjfB1QABNsWwa9gSca.jpg",
        "backdrop_path": "/h68ilwiTesb5wmDgy2mHYkVuOBP.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "During America’s Civil War, Union spies steal engineer Johnny Gray's beloved locomotive, 'The General'—with Johnnie's lady love aboard an attached boxcar—and he single-handedly must do all in his power to both get The General back and to rescue Annabelle.",
        "revenue": 1000000,
        "budget": 750000,
        "genres": [
            "Comedy",
            "Action",
            "Adventure",
            "War"
        ],
        "synopsis": "The Western & Atlantic Flyer \"speeds into Marietta, Georgia in the Spring of 1861,\" pulled by the locomotive \"General.\" The engineer, Johnnie Gray (Buster Keaton) gets down to oil around, and is observed by two admiring boys. He has two loves: his engine and his girl. The two boys follow him when he goes to call on Annabelle (Marion Mack). They follow him right into her house, and he has to trick them to get them to leave. He presents Annabelle with a portrait of himself in front of his engine. Annabelle's brother (Frank Barnes) arrives with the news that war has broken out. He and their father (Charles Smith) go to enlist. Annabelle expects Johnnie to enlist, so he says goodbye. She gives him a kiss, and he backs off the edge of the porch.\n\nJohnnie runs by a shortcut and vaults a counter to be first in line. He doesn't hear that he is \"more valuable to the South as an engineer,\" so he doesn't understand why he is rejected. He tries two more times to sign up, but is kicked out the door. Annabelle's father and brother invite him into the line, but he has had enough. They think he is a disgrace, and tell Annabelle he never got in line. He sits dejected on his engine's siderod. Annabelle tells him she won't speak to him until he is in uniform. An engine hostler moves the engine, with Johnnie still sitting on the siderod. He doesn't notice until, on the third revolution, the locomotive is entering the engine-house.\n\nOne year later, in Chattanooga, Gen. Thatcher (Jim Farley) and his \"chief spy\" Capt. Anderson (Glen Cavender) hatch a plan to take a group of spies to steal a train at Big Shanty and drive it north, burning bridges to cut the supply line to the Confederate army threatening Chattanooga.\n\nAt Marietta, Annabelle boards Johnnie's train to visit her wounded father. Johnnie sees her pointedly fuss with her brother's medals. When the train stops at Big Shanty for breakfast, Anderson and his men get off on the side away from the station. Annabelle gets into one of the boxcars to retrieve money from her trunk. The men remove the coupling pin between the boxcars and the coaches, get aboard, and start the engine. They discover Annabelle, and have to take her. Johnnie calls for others to follow him, as he runs after his train, but they soon give up running.\n\nThe Yankee spies tie up Annabelle. They stop to cut the telegraph wires, and back at Big Shanty, the operator notices the line go dead. Johnnie stops at a handcar shed, and only then notices that no one has followed him. But he gets the handcar going. The spies remove a rail and jam stones in the guardrail. Johnnie falls off the handcar, which runs off the track and smashes down an embankment. The \"General\" speeds past Kingston, where the \"Texas\" waits on a siding. Johnnie sees a bicycle, which he leaps on, but it doesn't work well along the rough roadbed. On the \"General,\" Capt. Anderson unpacks a Confederate uniform. Johnnie runs into Kingston and shouts for help. Soldiers pile onto the flatcar behind the \"Texas.\" Johnnie pulls the pin behind the flatcar to leave the rest of the train, but the flatcar is not coupled to the locomotive, and when he speeds away he does not notice the flatcar full of soldiers is left behind.\n\nBy the time he notices he is alone, Johnnie sees a railroad mortar on a siding. The Yanks have stopped for water and wood. Johnnie is pulling the mortar car. The spies see him, and pull away without shutting off the water, and Johnnie gets an unexpected shower. Capt. Anderson won't stop and fight because he assumes they are outnumbered. They chop through the rear wall of the end boxcar. Back on the mortar car, Johnnie loads one handful (and a bit more) of powder, wadding, and a cannonball into the mortar, aimed to arc over the engine and hit the spies. He lights the fuse, and hurries back over the tender to the engine. The mortar fires, and sends the cannonball in a short arc right into the cab. Johnnie rolls it out of the cab and returns to the mortar. As he prepares another shot, there is a huge explosion beside the track back down the line. This time he puts the whole canister of powder in the gun. In hurrying back to the cab, his foot gets caught in the coupling bar, and dislodges it. When he finally gets his foot unstuck, the bar falls down and bangs against the crossties. The jostling makes the mortar lower until it points right at Johnnie, who has now got his foot caught in a loop of chain. He gets free, and scrambles all the way to the cowcatcher. The two trains enter an S-curve, and are at just the right places when the mortar fires that the shot misses the \"Texas\" and explodes just behind the spies.\n\nThe Yanks release the rear boxcar to leave it in Johnnie's way. He pushes it onto a passing siding and proceeds. Busy feeding the fire, he doesn't notice that the boxcar continues to roll to the end of the siding and back onto the main track. He can't figure out how the boxcar got in front of him again. From the remaining boxcar the Yanks drop timbers across the rails. Johnnie, looking for a cloth to handle a leaky valve, doesn't see when the boxcar hits one of the timbers and is derailed out of the way. He can't figure out why the boxcar is now gone.\n\nNow he can see the timbers on the track. He slows the engine, and runs ahead to lift the first one. But he stumbles, and falls back onto the moving cowcatcher, holding the timber. With adroit timing, he uses it to hit the next one out of the way.\n\nThe Yanks throw a switch to a spur track, and lift Annabelle over the tender to the engine cab. Johnnie, occupied with firewood again, sees just in time to stop before the end of the spur track. He backs out of the siding, and starts the engine forward, but the wheels slip. He gets down to throw dirt onto the rails. He doesn't notice when the wheels get a grip and the engine pulls away. He has to run to jump on the back of the tender.\n\nThe Yanks have started a fire in the remaining boxcar, and they leave it in a covered bridge. Johnnie arrives in time to push it out. But there is so much smoke in the cab that he retreats to the tender deck, where he sits on the water hatch, not having noticed the lid is not on. He finally diverts the burning car onto a siding.\n\nJohnnie is so busy chopping wood on the tender he does not notice the Confederate army retreating. The Union army now passes, and Capt. Anderson removes his Confederate uniform. Johnnie finally notices the Union soldiers, and crouches down on the floor of the cab.\n\nThe \"General\" passes under a trestle, and loops around to stop on the trestle above. When Johnnie passes below, the Yanks drop timbers down on him. Some land on the tender, providing fuel. But Capt. Anderson gets a good look, and says, \"There is only one man on that engine.\" Johnnie stops, and gets off to hide in the woods. It starts to rain.\n\nWhen night falls, Johnnie climbs through the window of a house and takes food from the dining table. When a number of Union officers enter, he hides under it, and hears them planning to get supply trains across the Rock River bridge so the army can attack the Confederates the next day. One officer's cigar burns a hole in the tablecloth, and Johnnie is able to see when Annabelle is brought in and locked in the next room. The officers leave. Johnnie knocks out a sentry with a log and steals his uniform. He knocks out another sentry with his rifle butt, and climbs in the window of Annabelle's room. He gets her through the window, and leads her into the forest. They encounter a bear, and both get stuck in a bear trap. Johnnie keeps losing Annabelle, so he decides they should stay in one place until dawn.\n\nThe next morning, Johnnie sees his locomotive. He empties a large sack of boots and stuffs Annabelle into the bag. Then he realizes one of his own shoes has come off and he has to find it among all those on the ground. He joins a line of soldiers loading the boxcar behind the \"General.\" He stands where Annabelle can reach to uncouple it from the rest of the train, then puts her into the boxcar as a bag of supplies. He cringes and covers his eyes when he sees a crate and a barrel tossed in after her. He joins the line loading firewood, knocks out the officer in the cab, and starts the engine, heading back south.\n\nJohnnie stops outside of town, loops a rope over a telegraph pole, and ties it to the boxcar. When he pulls away, the pole and wire are pulled down, and the telegraph line is cut. He chops the rope, leaving the pole across the track. From the tender, he chops through the front wall of the boxcar, climbs in, and searches for Annabelle. He finds her among all the freight only when he steps on the sack she is in. Then he has to help her get across to the tender.\n\nJohnnie stops to throw fence rails onto the tender for firewood, but he has some difficulty getting them to stay there. Meanwhile, the Yanks have given chase with the Texas and another engine. They have to stop to get the telegraph pole out of the way. Annabelle takes what is left of the rope, and ties it across the track between two young pine trees. Johnnie almost leaves without her. When she shows Johnnie what she has done, he demonstrates how ridiculously flimsy it is. But the Yanks are coming, and they scramble into the engine cab and start off. The rope pinions the soldiers riding the \"Texas\" and the two trees are uprooted and get caught up in the siderods. Annabelle's arrangement has succeeded in forcing the pursuers to stop once more.\n\nJohnnie knocks out the whole back wall of the boxcar. The Yanks have to stop again to clear it off the track. He slows them down by tossing all the freight onto the track out the open back. In the cab, the Union officer is just regaining consciousness. Johnnie returns just in time, knocks him out with a well-aimed log, and takes his pistol.\n\nThey stop at a water tank. Johnnie does not notice he has pulled the spout away from the supply pipe. When he opens the valve, Annabelle is knocked down by the deluge. He replaces the spout, and she gets more water over her. They leave, the water still flowing, and it drenches the officers on both the chasing trains.\n\nAnnabelle feeds the fire. She sees a log with a big hole in it, and rejects it, tossing it out of the cab. Johnnie can't believe it. The Yanks plan to couple to the rear of the boxcar. Annabelle sweeps the cab; Johnnie tosses the broom. Annabelle feeds the fire with kindling; Johnnie picks up a sliver and hands it to her. She tosses it in the firebox. He shakes her, then kisses her.\n\nThe Yanks catch up, and couple to the rear of the boxcar. At the forward end, Johnnie uncouples it. The Yanks fire at him. They switch the boxcar into a siding, then back out onto the main track. The second train smashes into them, knocking down officers. They just get re-seated when the train starts with a lurch, and they tumble again.\n\nJohnnie fastens a chain between the tender and some switch points. He has Annabelle start the engine, and the chain deforms the switch points. But Annabelle cant stop the engine. Johnnie runs downhill to meet her where the track passes below, but she gets the locomotive reversed, and he has to scramble back up the hill. They meet the Yanks at the broken switch, where the two Yank trains end up on an elevated spur track, smashing again, allowing Johnnie and Annabelle to get away.\n\nJohnnie sticks the end of a fence rail in the fire. He stops in the middle of the old unstable wooden Rock River bridge of Doom, and piles firewood on the ties behind the tender. Meanwhile, the Yank officers can't figure out how to fix the switch so they can continue the pursuit, and a Union army is approaching the rendezvous at the bridge. Johnnie pours kerosene from the headlamp onto the firewood. Annabelle knocks the burning fence rail off the tender, and Johnnie is trapped on the far side of the fire in the middle of the bridge. He jumps over the fire just as Annabelle moves the engine forward, and Johnnie falls through a gap into the river but luckily they both manage to swim to safety.\n\nThe Yank officers are still ineptly dealing with the broken switch. Johnnie hails a Confederate picket, and is fired at. Annabelle points out that he is still wearing the Yankee uniform, so he changes. They pull into Marietta, with the whistle blasting, and Johnnie runs to the Division Headquarters to warn them of the attack. The General leads the army out of town, and Johnnie and Annabelle find themselves in the middle of a stampede of traffic. Annabelle sees her wounded father, and Johnnie is left in the deserted street. He finds a sword belt and pistol, straps them on, and follows the army.\n\nThe Yank officers are still trying to fix the switch. A locomotive engineer pushes his way through them and does a neat, quick fix using an ax. The two engines reach the Rock River bridge at the same time as the Union army arrives. The General (not realising how unstable and burned up the bridge is) says, \"That bridge is not burned enough to stop you, and my men will ford the river.\" The \"Texas\" proceeds onto the bridge to chase them, until suddenly it loses control from the old unstable bridge and plunges down from great height to the reveighn below, and the engine has a big train crash into the lake.\n\nThe Confederates surprise the Union army, and a fight begins. Johnnie is near an officer, and he imitates his commanding gestures, but his sword keeps coming apart. He stands near a gun battery, where a sharpshooter keeps picking off the artillerymen. Finally Johnnie's broken sword is effective. At his commanding swing, the blade comes off again and spears the sharpshooter. Johnnie tries firing the unmanned cannon. He has to yank the firing lanyard so hard that the gun tilts straight up before firing. He retreats, but the shot lands in the river, blowing a dam. The surge of water catches the Yankee infantry in the river, forcing them to retreat. Johnnie directs the other artillerymen to fire at officers on the remaining train. They retreat, and the whole army retreats. Johnnie directs another shot that derails the last car, stopping the retreating supply train. Johnnie saves a battle flag, and mounts a rock, inadvertently stepping on an officer who was observing from a cleft.\n\nThe victorious army marches back into town, with Johnnie among those leading. He peels off and sits on the rear of his locomotive. When he goes into the cab, he finds the forgotten Yank officer just waking up. He escorts him to Division Headquarters and hands him over to the General. After a brief explanation, the General has Johnnie remove the uniform that does not belong to him, as Annabelle and her father watch. The General then gives him an officers coat and the Yankees surrendered sword. He poses for Annabelle and is enlisted as a Lieutenant.\n\nJohnnie takes Annabelle to the General, and they sit together on the siderod. His kiss is interrupted by the need to salute a passing soldier . . . then another . . . and another. Then a whole regiment approaches, so Johnnie repositions so he can kiss Annabelle while he pumps his hand up and down in salute after salute.",
        "director": "Buster Keaton"
    },
    {
        "imdb_id": "146026",
        "title": "Toad Warrior",
        "release_date": "1996-03-19",
        "duration": 80,
        "ave_rate": "0.0",
        "poster_path": "/fb5gxugD6Htmv2dstpeQxh0Z3wx.jpg",
        "backdrop_path": "/7rHMZPFUlBgMij0UrVkvHvuWk0V.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "This film follows the lead character, Max Hell, who goes on a mission to rescue Dr. Trixi T from the clutches of the evil Mickey O'Malley.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Science Fiction"
        ],
        "synopsis": "",
        "director": "Scott Shaw"
    },
    {
        "imdb_id": "730840",
        "title": "Trollhunters: Rise of the Titans",
        "release_date": "2021-07-21",
        "duration": 106,
        "ave_rate": "0.0",
        "poster_path": "/zvUNFeTz0Sssb210wSiIiHRjA4W.jpg",
        "backdrop_path": "/3OwaKVZf3A2NdnarqKbwzFEhKir.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "The Guardians of Arcadia reunite to battle the nefarious Arcane Order, who've reawakened the primordial Titans.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Animation",
            "Fantasy",
            "Family",
            "Action",
            "Adventure"
        ],
        "synopsis": "",
        "director": "Johane Matte"
    },
    {
        "imdb_id": "17040",
        "title": "Turok: Son of Stone",
        "release_date": "2008-02-05",
        "duration": 73,
        "ave_rate": "0.0",
        "poster_path": "/oPjlJfeyK6YluQDxWVn9K3wYxA0.jpg",
        "backdrop_path": "/1LHNsKJ73rXI746zxTEuCxWZpIR.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "While defending his tribe from a bloodthirsty enemy tribe, a Native American warrior named Turok finds himself in a prehistoric dinosaur world along with his nephew, sister-in-law and the sadistic leader of the other tribe.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Animation",
            "Science Fiction"
        ],
        "synopsis": "During 20 years in exile, Turok has become a powerful and feared warrior. He now returns home to find his village destroyed and his family slaughtered at the hands of the ruthless tyrant Chichak. On a mission of vengeance, Turok must journey to the Lost Land, a savage place forgotten by time, where primeval beasts hunt all who enter. Turok will face his greatest battle as he fights man-eating dinosaurs, merciless cave dwellers, and the darkness inside himself to take revenge on his sworn enemy. In this epic journey, Turok will find his destiny. In this Lost Land A legend is born.",
        "director": "Frank Squillace"
    },
    {
        "imdb_id": "14611",
        "title": "Ultimate Avengers 2",
        "release_date": "2006-08-08",
        "duration": 73,
        "ave_rate": "0.0",
        "poster_path": "/h1PKqtjuTifmTU0EqM4W0Br2pHX.jpg",
        "backdrop_path": "/hoJpIYgFPc75NhaSWPNUeMFPMy1.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "Mysterious Wakanda lies in the darkest heart of Africa, unknown to most of the world. An isolated land hidden behind closed borders, fiercely protected by its young king: Black Panther. But when brutal alien invaders attack, the threat leaves Black Panther with no option but to go against the sacred decrees of his people and ask for help from outsiders.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Adventure",
            "Animation",
            "Action",
            "Science Fiction"
        ],
        "synopsis": "",
        "director": "Dick Sebast"
    },
    {
        "imdb_id": "135305",
        "title": "Ultraman: The Adventure Begins",
        "release_date": "1987-10-12",
        "duration": 78,
        "ave_rate": "0.0",
        "poster_path": "/lnRj1vdjxSoMtTonFtASoebM5hX.jpg",
        "backdrop_path": "/u3g5zYjHn3MKhFlfYC17DsiMnyR.jpg",
        "origin_country": [
            "US"
        ],
        "summary": "The lives of three stunt pilots (Scott, Chuck, and Beth) are changed when they gain the ability to transform into three new Ultra-beings, and form the Ultra Force, to battle four giant Sorkin Monsters.",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Adventure",
            "Animation",
            "Science Fiction"
        ],
        "synopsis": "",
        "director": "Ray Patterson"
    },
    {
        "imdb_id": "416777",
        "title": "Viking Legacy",
        "release_date": "2016-09-19",
        "duration": 83,
        "ave_rate": "0.0",
        "poster_path": "/lMPPPBTgsDLPRtKz56KehsFEHO7.jpg",
        "backdrop_path": "/13aqACYimNH8IIOzJmXBOL7QGn3.jpg",
        "origin_country": [
            "US",
            "GB"
        ],
        "summary": "In ancient times, there were seven sacred scrolls believed to grant power and prosperity to those who possessed them. Prophecy told that a child born in pure Royal blood would one day harness power and rule over the nations. As men fought to claim the scrolls, Europe was pushed to the brink of war. In order to maintain peace, a Celtic King, the Father of a pure blood child, obtained the scrolls and gave them to the Christian Council for safe keeping. As word of the King’s actions spread, a warlord hell – bent on finding the scrolls murdered him in cold blood. And so, the King’s Daughter, like the scrolls, was taken into hiding until the day that the prophecy could be fulfilled ...",
        "revenue": 0,
        "budget": 0,
        "genres": [
            "Action",
            "Adventure"
        ],
        "synopsis": "",
        "director": "Victor Mawer"
    },
    {
        "imdb_id": "83192",
        "title": "Yakuza Weapon",
        "release_date": "2011-02-27",
        "duration": 105,
        "ave_rate": "0.0",
        "poster_path": "/qWOLAVrfbBxLfG1GYJlpZBRseEr.jpg",
        "backdrop_path": "/jV5PCB9ab0k04tPGu3qB1jyupSn.jpg",
        "origin_country": [
            "JP"
        ],
        "summary": "After four years overseas, Shozo returns to Japan to avenge his yakuza boss who was assassinated by his own treacherous top man, Kurawaki. The resulting battle leaves both men severely injured, and Shozo awakens in a mysterious medical facility to find his arm replaced with an M61 Vulcan cannon and his leg replaced with a rocket launcher. Meanwhile, Kurawaki has been fitted with mechanical augmentations of his own. Get ready for the second round.",
        "revenue": 0,
        "budget": 600000,
        "genres": [
            "Action",
            "Thriller",
            "Science Fiction"
        ],
        "synopsis": "",
        "director": "Tak Sakaguchi"
    },
    {
        "imdb_id": "28925",
        "title": "Zone of the Dead",
        "release_date": "2011-01-20",
        "duration": 101,
        "ave_rate": "0.0",
        "poster_path": "/iseilkcyk3QwAQNKJoY5SMqYu5G.jpg",
        "backdrop_path": "/JTPvDYH8BtvktQjqaFTuBzpFVe.jpg",
        "origin_country": [
            "RS"
        ],
        "summary": "A police-escorted prisoner transport supervised by Interpol sets off to Belgrade. The route leads the transport through Pančevo, where they encounter an ecological disaster and infected people who are trying to kill them. Interpol agents Mortimer Reyes and Mina Milius soon realize that their only chance for escape from the zombie hordes lies in allying with the dangerous, mysterious prisoner.",
        "revenue": 0,
        "budget": 1000000,
        "genres": [
            "Horror",
            "Action"
        ],
        "synopsis": "Borat and his Serbian friends are stuck in a zombie apocalypse. Former zombiestar Ken Foree joins the Eastern European heroes in a struggle of surviving an attack of bad acting, poor dialog and the worst accent in the world. They fight their way through Belgade (beautiful city, untouched). Zone of the Dead is an amazing film. It's worth studying; if you feel the need to study how not to make a movie.",
        "director": "Milan Konjević"
    }
]